[
  {
    "category": "eraType:neolithic",
    "concept": "conceptType:technology",
    "description": "Sailing emerged as a key maritime technology in riverine and coastal settings during antiquity. Early Egyptian craft on the Nile used bundled reed hulls and adopted sails by the late fourth millennium BCE. Mesopotamian communities built bitumen-sealed boats for Persian Gulf trade linking Sumer, Dilmun, and Magan. In the Bronze Age Aegean, Minoan seafarers developed specialized hulls and rigging for inter-island exchange and naval patrols. Square sails, bipod masts, and stone anchors allowed sustained voyages with reliable cargo capacity. Navigators practiced coastal piloting, read winds and currents, and used rudimentary astronomical cues. Sailing enabled the movement of copper, tin, grain, textiles, and prestige goods at regional scale. It supported colonization, diplomatic networks, and the transfer of metallurgical and artistic knowledge. By the late second millennium BCE, monsoon sailing in the western Indian Ocean connected Red Sea and Gulf ports with Arabia and the Indus. These systems laid the foundations for later classical and medieval maritime economies.",
    "image": "/media/images/technologyType/sailing.jpg",
    "key": "technologyType:sailing",
    "name": "Sailing",
    "quote": {
      "text": "Give a man a fish, feed for a day. Teach him to fish, feed for life.",
      "source": "Anne Thackeray Ritchie, 1885",
      "url": "/media/quotes/technologyType/sailing.mp3"
    },
    "x": 0,
    "y": 0,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 15
      }
    ]
  },
  {
    "category": "eraType:neolithic",
    "concept": "conceptType:technology",
    "description": "Agriculture began as the cultivation of cereals and pulses in the early Holocene. In the Fertile Crescent, wheat and barley were domesticated alongside lentils and peas. Settled villages stored harvests in silos and processed grain with sickles and grinding stones. Along the Yangtze, early paddy systems fostered rice domestication and wet-field management. Irrigation on the Tigris and Euphrates stabilized yields and allowed expansion onto alluvial plains. The ard plow and simple field systems increased labor efficiency and supported larger households. Surplus production promoted craft specialization, taxation, and the rise of hierarchical institutions. Seasonal calendars, land tenure, and ritual cycles integrated cultivation with social life. Over time, mixed farming combined crops with livestock for manure and traction. Agriculture transformed landscapes through deforestation, terraces, and canals. It generated enduring exchange networks for seed, tools, and knowledge that linked villages and early cities across Southwest Asia, the Nile Valley, South Asia, and East Asia.",
    "image": "/media/images/technologyType/agriculture.jpg",
    "key": "technologyType:agriculture",
    "name": "Agriculture",
    "quote": {
      "text": "Bread is the reward of honest toil.",
      "source": "Instruction of Amenemope, 1100 BCE",
      "url": "/media/quotes/technologyType/agriculture.mp3"
    },
    "x": 8,
    "y": 0,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 15
      }
    ]
  },
  {
    "category": "eraType:neolithic",
    "concept": "conceptType:technology",
    "description": "Trapping refers to the capture of animals with pits, snares, deadfalls, and other mechanical devices. Paleolithic communities used large pitfall systems and drive lines to take herd animals and occasional megafauna. Knowledge of tracks, migration routes, and baiting underpinned success. In wetlands and rivers, basket traps and weirs secured fish and eels with low energy cost. Neolithic settlements relied on snares for small game and birds to complement farming and herding. Materials included plant fibers, sinew, wood, and stone weights. Trapping provided meat, hides, bone, and later valuable furs. It suited dispersed labor schedules and could be monitored alongside other tasks. Archaeological signatures include stake alignments, pit arrays, and wear on toggles and cordage. The practice supported food security during seasonal shortages and reduced risk in hunting. Its methods spread widely through teaching and imitation, adapting to local ecologies from forests to steppe and coastal zones.",
    "image": "/media/images/technologyType/trapping.jpg",
    "key": "technologyType:trapping",
    "name": "Trapping",
    "quote": {
      "text": "A net spread in sight catches no bird.",
      "source": "Proverbs, ca. 400 BCE",
      "url": "/media/quotes/technologyType/trapping.mp3"
    },
    "x": 4,
    "y": 0,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 15
      }
    ]
  },
  {
    "category": "eraType:neolithic",
    "concept": "conceptType:technology",
    "description": "Animal husbandry developed with the domestication of goat and sheep in the Zagros and adjacent regions by the early Neolithic. Herd management soon included cattle and pigs in Southwest Asia and neighboring areas. Pastoral practices in Mesopotamia combined sheep flocks for wool with cattle for traction and meat. Selective breeding favored docility, milk yield, and fleece quality. Dairying produced yogurt, cheese, and clarified butter, expanding storage options and nutrition. Herding strategies ranged from village-based pens to transhumant movements between seasonal pastures. Manure fertilized fields and closed nutrient cycles with nearby crops. Secondary products such as wool and leather fed craft industries and long-distance trade. Animal power increased agricultural productivity through plowing and transport. Husbandry also introduced new disease dynamics to human communities. Administrative records, herd counts, and ration lists in early cities attest to the economic centrality of managed livestock throughout the ancient Near East and beyond.",
    "image": "/media/images/technologyType/animalHusbandry.jpg",
    "key": "technologyType:animalHusbandry",
    "name": "Animal Husbandry",
    "quote": {
      "text": "Know well your flocks; you will not lack.",
      "source": "Proverbs, ca. 400 BCE",
      "url": "/media/quotes/technologyType/animalHusbandry.mp3"
    },
    "x": 12,
    "y": 0,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 15
      }
    ]
  },
  {
    "category": "eraType:neolithic",
    "concept": "conceptType:technology",
    "description": "Herbal remedies formed the earliest systematic pharmacopeia. Practitioners identified plants for pain relief, digestion, antisepsis, and wound care, and prepared them as infusions, poultices, and ointments. The Ebers Papyrus in Egypt records hundreds of plant-based treatments and procedures. Sumerian tablets list ingredients such as willow, coriander, and juniper with dosing instructions. Solvents like water, beer, and wine extracted active compounds. Mineral and animal substances were sometimes added to enhance efficacy. Healing combined empirical observation with ritual, prayers, and incantations. Knowledge moved through apprenticeships and temple archives, and circulated along trade routes with spices and resins. Some remedies, such as salicylate-rich willow bark and flaxseed preparations, had measurable pharmacological effects. Others served primarily as protective or purifying agents within local belief systems. These traditions provided the foundation for later medical compilations in the Mediterranean, Persia, India, and China.",
    "image": "/media/images/technologyType/herbalRemedies.jpg",
    "key": "technologyType:herbalRemedies",
    "name": "Herbal Remedies",
    "quote": {
      "text": "The gods who wound also grow the healing herbs.",
      "source": "Mesopotamian proverb",
      "url": "/media/quotes/technologyType/herbalRemedies.mp3"
    },
    "requires": ["technologyType:trapping"],
    "x": 4,
    "y": 2,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 19
      }
    ]
  },
  {
    "category": "eraType:neolithic",
    "concept": "conceptType:technology",
    "description": "Settlements arose as communities began occupying fixed locations for extended periods, building permanent structures and organizing space for storage, craft, and communal life. Early settled villages in the Fertile Crescent, Anatolia, and East Asia combined agricultural plots with defended storage facilities and ritual areas. Fixed residence allowed accumulation of tools, surplus grain, and social knowledge. Over time, settlements grew into larger nucleated communities with planned layouts, dedicated workshops, and communal infrastructure. The transition from mobile to settled life restructured kinship, labor, and exchange, creating conditions for later urban institutions.",
    "image": "/media/images/technologyType/settlements.jpg",
    "key": "technologyType:settlements",
    "name": "Settlements",
    "quote": {
      "text": "They shall sit every man under his vine and under his fig tree.",
      "source": "Micah 4:4",
      "url": "/media/quotes/technologyType/settlements.mp3"
    },
    "requires": ["technologyType:agriculture"],
    "x": 8,
    "y": 2,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 19
      }
    ]
  },
  {
    "category": "eraType:neolithic",
    "concept": "conceptType:technology",
    "description": "Wood working supplied tools, dwellings, vehicles, and boats from the Neolithic onward. Craftspeople used adzes, chisels, bow drills, and saws, first in stone and later in copper and bronze. Joinery methods such as mortise-and-tenon, dowels, and lashings produced durable frames and furniture. Large timber longhouses in Neolithic Europe required planned felling, seasoning, and fitted posts. Dugout canoes carved from single trunks enabled riverine transport and fishing. Shipwrights refined planking and edge-joining for lighter hulls. Wheelmaking and sledge construction expanded land transport. Surface finishes, resins, and pigments protected and decorated wooden surfaces. Workshops developed standardized parts and templates to speed production. Offcuts fueled hearths and kilns, integrating carpentry with broader settlement economies. Archaeological finds from waterlogged contexts preserve tool marks and assembly techniques, allowing reconstruction of craft sequences and regional styles across early Eurasia and the Nile Valley.",
    "image": "/media/images/technologyType/woodWorking.jpg",
    "key": "technologyType:woodWorking",
    "name": "Wood Working",
    "quote": {
      "text": "Wood is bent and shaped by the craftsman’s careful hand.",
      "source": "Saʿdī, The Gulistān, 1258",
      "url": "/media/quotes/technologyType/woodWorking.mp3"
    },
    "requires": ["technologyType:animalHusbandry"],
    "x": 12,
    "y": 2,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 19
      }
    ]
  },
  {
    "category": "eraType:neolithic",
    "concept": "conceptType:technology",
    "description": "Mysticism in antiquity sought direct engagement with spirits, ancestors, or deities through altered states and controlled ritual. Shamanic practices across prehistoric Eurasia used drumming, chanting, and fasting to induce visions for healing and divination. Sacred specialists mediated hunts, weather, and community fate. In early Mesopotamian temples, offerings and oracles framed communication with gods alongside administrative activity. Ritual paraphernalia included masks, drums, and carved amulets. Knowledge passed through tutelage and lineage, bounded by taboos. These systems shaped moral order, sanctioned leadership, and structured responses to misfortune and illness.",
    "image": "/media/images/technologyType/mysticism.jpg",
    "key": "technologyType:mysticism",
    "name": "Mysticism",
    "quote": {
      "text": "Life is the moon’s shadow on water.",
      "source": "Chinese proverb",
      "url": "/media/quotes/technologyType/mysticism.mp3"
    },
    "requires": ["technologyType:herbalRemedies"],
    "x": 2,
    "y": 4,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 23
      }
    ]
  },
  {
    "category": "eraType:neolithic",
    "concept": "conceptType:technology",
    "description": "Tradition organized social life through inherited rules, stories, and rites. Clan law and councils of elders settled disputes and arranged marriages. Seasonal festivals marked planting, harvest, and animal cycles, reinforcing labor coordination and alliance. Oral transmission preserved genealogies, boundaries, and craft recipes. Custom regulated property, reciprocity, and compensation for injury. Initiation and funerary rites managed status and memory. Stability in tradition supported predictable exchange and cooperation between households and neighboring groups, while allowing gradual adaptation to new tools and crops.",
    "image": "/media/images/technologyType/tradition.jpg",
    "key": "technologyType:tradition",
    "name": "Tradition",
    "quote": {
      "text": "Children must remember the words of ancestors.",
      "source": "Yoruba proverb",
      "url": "/media/quotes/technologyType/tradition.mp3"
    },
    "requires": ["technologyType:herbalRemedies", "technologyType:settlements"],
    "x": 6,
    "y": 4,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 23
      }
    ]
  },
  {
    "category": "eraType:neolithic",
    "concept": "conceptType:technology",
    "description": "Pit mining extracted shallow deposits of flint, chert, ochre, and soft copper ores, often in open excavations. Workers used antler picks, hammerstones, and fire-setting to loosen material. Spoil heaps, access ramps, and simple shoring formed characteristic landscapes. At Grimes Graves in Britain, Neolithic miners pursued high-quality flint for blades and axes. In Sinai, early pits yielded malachite for copper smelting and pigments. Materials moved through exchange networks to toolmakers and artisans. Hazards included roof fall, bad air, and tool wear, requiring experience and organized labor. Standardized blanks and core preparation suggest planned production and quality control.",
    "image": "/media/images/technologyType/pitMining.jpg",
    "key": "technologyType:pitMining",
    "name": "Pit Mining",
    "quote": {
      "text": "They first burnt the hard gold-bearing earth, then crushed it by hand.",
      "source": "Egyptian mining proverb, ca. 1000 BCE",
      "url": "/media/quotes/technologyType/pitMining.mp3"
    },
    "requires": ["technologyType:woodWorking", "technologyType:settlements"],
    "x": 10,
    "y": 4,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 23
      }
    ]
  },
  {
    "category": "eraType:neolithic",
    "concept": "conceptType:technology",
    "description": "Ancient warfare comprised organized raids, sieges of small fortified sites, and open skirmishes between villages or chiefdoms. Palisades, ditches, and watch platforms protected settlements and fields. Weapons included stone-tipped spears, bows, axes, clubs, and wooden shields. Tactics favored ambush, missile harassment, and pursuit rather than close formations. Skeletal trauma, mass burials, and burned layers record conflict frequency. Warfare shaped leadership roles, fortified boundaries, tribute systems, and alliance networks. Craft production met demand for points, shafts, and protective gear. Seasonal campaigns often aligned with post-harvest periods and food availability.",
    "image": "/media/images/technologyType/warfare.jpg",
    "key": "technologyType:warfare",
    "name": "Warfare",
    "quote": {
      "text": "All armies prefer high ground to low.",
      "source": "Sun Tzu, ca. 500 BCE",
      "url": "/media/quotes/technologyType/warfare.mp3"
    },
    "requires": ["technologyType:woodWorking"],
    "x": 14,
    "y": 4,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 23
      }
    ]
  },
  {
    "category": "eraType:copper",
    "concept": "conceptType:technology",
    "description": "Trade in the ancient world arose from surplus production and regional specialization. Communities exchanged obsidian, salt, textiles, and foodstuffs through gift exchange, barter, and itinerant exchange fairs. Early routes linked highland quarries to lowland settlements, moving prized stone and pigments over long distances. Canoes and pack animals extended reach along rivers and overland tracks. Obsidian from Anatolian sources traveled widely, traced today by geochemical signatures. Coastal Levantine settlements hosted barter markets that circulated timber, shell, and crafted goods. Standardized weight systems were rare at first, so equivalences were negotiated socially. Trade shaped settlement hierarchies by concentrating rare materials and skilled artisans in nodal towns. It also spread ideas and styles, carrying pottery shapes and tool forms between regions. Before formal markets and written accounts, these networks laid the groundwork for later commercial institutions.",
    "image": "/media/images/technologyType/trade.jpg",
    "key": "technologyType:trade",
    "name": "Trade",
    "quote": {
      "text": "Travel defeats poverty; the roamer grows strong.",
      "source": "Sumerian proverb, ca. 1800 BCE",
      "url": "/media/quotes/technologyType/trade.mp3"
    },
    "requires": ["technologyType:sailing", "technologyType:mysticism"],
    "x": 0,
    "y": 7,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 30
      }
    ]
  },
  {
    "category": "eraType:copper",
    "concept": "conceptType:technology",
    "description": "Copper working emerged from the use of native copper, first cold-hammered into beads and simple tools, then annealed to restore ductility. By the late Neolithic and Early Bronze Age, smelting of oxide and carbonate ores became common. Craftspeople cast ingots and tools in open molds and refined edges by hammering. Workshops appear at settlements with evidence of crucibles, slag, and tuyères. Çatalhöyük yielded early copper beads, while Balkan sites produced axe heads and chisels that show increasing metallurgical control. Copper’s softness limited cutting performance compared to later alloys, yet it enabled new tool types, riveted fittings, and ornamental status goods. Knowledge of furnace atmospheres, ore selection, and reworking cycles advanced steadily. These practices created the technical base and specialist communities that later adopted tin alloying, transitioning into bronze metallurgy and expanding the range and durability of metal artifacts.",
    "image": "/media/images/technologyType/copperWorking.jpg",
    "key": "technologyType:copperWorking",
    "name": "Copper Working",
    "quote": {
      "text": "The smith who casts the cup masters the fire.",
      "source": "Hittite proverb, ca. 1300 BCE",
      "url": "/media/quotes/technologyType/copperWorking.mp3"
    },
    "requires": ["technologyType:mysticism", "technologyType:tradition"],
    "x": 4,
    "y": 7,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 30
      }
    ]
  },
  {
    "category": "eraType:copper",
    "concept": "conceptType:technology",
    "description": "The wheel introduced rotary motion to transport and craft production in the Bronze Age. Solid wooden wheels mounted on fixed axles carried loads across plains, pulled by oxen or donkeys. Archaeology documents four-wheeled carts in early Mesopotamian contexts. The potter’s wheel, sometimes a slow-turning platform, enabled symmetrical vessels and increased output; variants are known from the Tripolye cultural sphere. Early wheel technology demanded seasoned timber, accurate boring, and joinery robust enough for rutted tracks. Wheeled vehicles transformed logistics by moving bulk goods like grain, clay, and stone more efficiently than human portage. In workshops, rotation powered forming and finishing tasks that had previously relied on hand-coiling. Later innovations introduced spoked wheels and improved hubs, but the initial adoption already reshaped settlement economies by extending hinterlands and integrating rural producers with urban stores and river landings.",
    "image": "/media/images/technologyType/wheel.jpg",
    "key": "technologyType:wheel",
    "name": "Wheel",
    "quote": {
      "text": "A chariot with wheels sparkling with gold.",
      "source": "The Death of Ur-Namma, ca. 2000 BCE",
      "url": "/media/quotes/technologyType/wheel.mp3"
    },
    "requires": ["technologyType:tradition", "technologyType:pitMining"],
    "x": 8,
    "y": 7,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 30
      }
    ]
  },
  {
    "category": "eraType:copper",
    "concept": "conceptType:technology",
    "description": "The sling is a compact projectile weapon consisting of a pouch and two cords. The user whirls stones to build angular momentum, then releases one cord to launch the projectile on a flat or arcing trajectory. In the Bronze Age, slingstones of river cobble or shaped clay were common; lead bullets appear later. Training produced high accuracy and long effective ranges against unarmored troops and light skirmishers. Near Eastern armies fielded slingers alongside archers to harass enemy lines, disrupt formations, and deny walls to defenders. Aegean communities used slings in coastal skirmishes and raids where portability mattered. The weapon’s low cost and ease of manufacture allowed widespread use by militia and shepherds. Archaeological finds include caches of slingstones at fortifications and depictions of slingers on reliefs. Tactical roles included screening advances, counter-skirmishing, and targeting crews on walls or chariot teams.",
    "image": "/media/images/technologyType/slings.jpg",
    "key": "technologyType:slings",
    "name": "Slings",
    "quote": {
      "text": "By sling and stone, the mighty falls.",
      "source": "Hebrew Bible, 1 Samuel 17, ca. 600 BCE",
      "url": "/media/quotes/technologyType/slings.mp3"
    },
    "requires": ["technologyType:pitMining", "technologyType:warfare"],
    "x": 12,
    "y": 7,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 30
      }
    ]
  },
  {
    "category": "eraType:copper",
    "concept": "conceptType:technology",
    "description": "Commerce formalized exchange through institutions, records, and infrastructure. In Bronze Age cities, temples and palaces managed stores, issued rations, and coordinated long-distance caravans. Merchant houses consolidated goods, arranged credit, and pooled risk for sea voyages and overland journeys. Standard weights and measures allowed value comparison across commodities. Cylinder seals authenticated containers and tablets, securing ownership and documenting transactions. Urban markets concentrated vendors and buyers under periodic or fixed schedules, while harbors and caravanserais supported transit. Silver by weight often served as an accounting unit even when barter persisted. Uruk warehouses illustrate early bulk handling; sealings and bullae track movement from store to store. These practices reduced transaction costs, extended trading horizons, and stabilized supplies of tin, textiles, grain, and timber. Commerce integrated regional economies and sustained craft specialization beyond local subsistence cycles.",
    "image": "/media/images/technologyType/commerce.jpg",
    "key": "technologyType:commerce",
    "name": "Commerce",
    "quote": {
      "text": "Let the measure be true and the seal intact.",
      "source": "Assyrian merchant letter, ca. 1900 BCE",
      "url": "/media/quotes/technologyType/commerce.mp3"
    },
    "requires": ["technologyType:trade", "technologyType:copperWorking", "technologyType:wheel"],
    "x": 4,
    "y": 9,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 36
      }
    ]
  },
  {
    "category": "eraType:copper",
    "concept": "conceptType:technology",
    "description": "Sieging encompasses methods to reduce fortified places through assault, blockade, or negotiation under pressure. Bronze Age attackers used earthen ramps, ladders, and fascines to cross ditches and reach parapets. Sappers undermined walls with timbered tunnels, collapsing sections by burning supports. Early battering rams, sometimes roofed, targeted gates and weak points. Defenders countered with ditches, glacis, projecting towers, and sorties to burn engines. Sumerian iconography depicts organized assaults on walled towns, and texts describe prolonged blockades to exhaust supplies. Logistics determined outcomes: armies required steady provisions, timber for engines, and specialized labor. Siegecraft evolved alongside fortification design, producing a technological contest between offensive tools and defensive architecture. The practice reshaped warfare by enabling the capture of stored wealth and administrative centers, thereby shifting power from mobile raiding to territorial control.",
    "image": "/media/images/technologyType/sieging.jpg",
    "key": "technologyType:sieging",
    "name": "Sieging",
    "quote": {
      "text": "Inside the walls, hunger slays those weapons spare.",
      "source": "Lament for Sumer and Urim, ca. 2000 BCE",
      "url": "/media/quotes/technologyType/sieging.mp3"
    },
    "requires": ["technologyType:wheel", "technologyType:slings"],
    "x": 10,
    "y": 9,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 36
      }
    ]
  },
  {
    "category": "eraType:copper",
    "concept": "conceptType:technology",
    "description": "Calendars ordered time for agriculture, ritual, and administration. Early systems observed lunar months, solar cycles, and stellar risings to mark seasons and schedule labor. The Egyptian civil calendar standardized a 365-day year with twelve 30-day months and five epagomenal days, aligning taxation and flood preparations despite drift from the true solar year. Babylonian administrators employed a lunisolar scheme, intercalating months to keep festivals and planting aligned with seasons; month names tied to celestial observations. Record-keeping on papyri and tablets used these frameworks to date contracts, rations, and deliveries. Priests and astronomer-scribes monitored new moons, solstices, and the heliacal rising of Sirius to refine predictions. The calendar’s precision underpinned stable ration cycles, temple offerings, and state projects, enabling coordination across regions and years.",
    "image": "/media/images/technologyType/calendar.jpg",
    "key": "technologyType:calendar",
    "name": "Calendar",
    "quote": {
      "text": "Read the stars to know when to sow.",
      "source": "Babylonian astronomical text, ca. 1000 BCE",
      "url": "/media/quotes/technologyType/calendar.mp3"
    },
    "requires": ["technologyType:commerce"],
    "x": 4,
    "y": 11,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 42
      }
    ]
  },
  {
    "category": "eraType:bronze",
    "concept": "conceptType:technology",
    "description": "Bronze working alloyed copper with tin to create a harder, more durable metal suited for blades, fittings, and cast forms. Craftspeople smelted ores, blended metals in crucibles, and cast objects using stone molds or lost-wax techniques. Heat treatment and hammer finishing improved edges and toughness. The alloy enabled longer swords, socketed axes, chisels, and complex vessels beyond the limits of pure copper. Demand for tin fostered long-distance trade linking mines to foundries and palace workshops. Mycenaean workshops produced standardized weapon types, while Shang foundries cast ritual vessels of high technical sophistication using sectional molds. Scrap recycling and ingot circulation formed a metal economy that could be mobilized by states. Bronze working transformed warfare, agriculture, and ceremony, and it created specialized labor groups embedded within urban administrative systems.",
    "image": "/media/images/technologyType/bronzeWorking.jpg",
    "key": "technologyType:bronzeWorking",
    "name": "Bronze Working",
    "quote": {
      "text": "Bronze is the mirror of the brave.",
      "source": "Chinese proverb, ca. 300 BCE",
      "url": "/media/quotes/technologyType/bronzeWorking.mp3"
    },
    "requires": ["technologyType:calendar"],
    "x": 4,
    "y": 14,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 50
      }
    ]
  },
  {
    "category": "eraType:bronze",
    "concept": "conceptType:technology",
    "description": "Pottery provided durable containers for storage, cooking, and trade. Clay was levigated, formed by coiling or wheel-throwing, then fired in open hearths or kilns. Surface treatments included burnishing, slips, paints, and, in Egypt, faience glazing on silica-rich bodies. Vessel shapes tracked function: pithoi stored bulk goods, jars carried oils, and bowls served daily meals. Standardized forms eased measurement and exchange, while stamps or painted marks identified workshops or contents. In the Aegean, Minoan pithoi and decorated wares indicate complex storage and redistribution systems. Egyptian painted ceramics and faience show elite consumption and temple demand. Pottery scatters mark trade routes and settlement hierarchies, since broken sherds persist across landscapes. Advances in the potter’s wheel increased output and symmetry, supporting urban provisioning and specialized craft districts.",
    "image": "/media/images/technologyType/pottery.jpg",
    "key": "technologyType:pottery",
    "name": "Pottery",
    "quote": {
      "text": "Clay takes the form the potter wills.",
      "source": "Isaiah 29, ca. 700 BCE",
      "url": "/media/quotes/technologyType/pottery.mp3"
    },
    "requires": ["technologyType:calendar", "technologyType:sieging"],
    "x": 8,
    "y": 14,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 50
      }
    ]
  },
  {
    "category": "eraType:bronze",
    "concept": "conceptType:technology",
    "description": "Mining in the Bronze Age extracted copper, tin, and other minerals through open workings and underground galleries. Miners used stone hammers, antler picks, and fire-setting to fracture ore-bearing rock, then removed spoil with baskets. Timbering stabilized shafts; simple ventilation and drainage managed fumes and water. Processing took place nearby with crushing, washing, and smelting, leaving slag heaps and furnace remains. The Timna Valley preserves copper mines with associated smelting installations and camps. Tin sources, including Cornish deposits, entered trade networks supplying alloying metal to distant foundries. Organization required seasonal labor, provisioning, and oversight by local elites or temples. Mining reshaped landscapes and anchored technical communities skilled in geology, timbering, and furnace operation. Its products underwrote metallurgical industries and the institutional power that managed them.",
    "image": "/media/images/technologyType/mining.jpg",
    "key": "technologyType:mining",
    "name": "Mining",
    "quote": {
      "text": "From its rock, he cuts out sapphires.",
      "source": "Job 28, ca. 600 BCE",
      "url": "/media/quotes/technologyType/mining.mp3"
    },
    "requires": ["technologyType:bronzeWorking"],
    "x": 2,
    "y": 16,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 58
      }
    ]
  },
  {
    "category": "eraType:bronze",
    "concept": "conceptType:technology",
    "description": "Irrigation in the Bronze Age transformed arid and seasonal landscapes into stable agricultural zones. In southern Mesopotamia, canal networks, levees, and regulators diverted Euphrates and Tigris water to field grids supporting Sumerian city-states. Regular dredging and embankment repair were organized through temple and palace labor. In Old Kingdom Egypt, basin irrigation timed to Nile flood pulses stored water behind dikes for staged release; nilometers informed schedules. Devices such as simple sluices and later the shaduf extended reach to higher plots. Intensive watering raised yields of barley, wheat, and flax but demanded salinity management and fallowing. Irrigation underwrote surplus, taxation in kind, and urban specialization, while also binding communities to coordinated maintenance and hydraulic administration.",
    "image": "/media/images/technologyType/irrigation.jpg",
    "key": "technologyType:irrigation",
    "name": "Irrigation",
    "quote": {
      "text": "He who controls water controls the land.",
      "source": "Egyptian wisdom text, ca. 1500 BCE",
      "url": "/media/quotes/technologyType/irrigation.mp3"
    },
    "requires": ["technologyType:bronzeWorking", "technologyType:pottery"],
    "x": 8,
    "y": 16,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 58
      }
    ]
  },
  {
    "category": "eraType:bronze",
    "concept": "conceptType:technology",
    "description": "Shipbuilding in the Bronze Age created durable hulls for trade, diplomacy, and war across seas and long rivers. Eastern Mediterranean craftsmen used shell-first construction with mortise-and-tenon joinery to lock planks into tight seams, as attested on the Uluburun wreck and depicted in Aegean art. Minoan and later Mycenaean merchants operated sailing and oared craft moving metals, textiles, and ceramics among island and coastal hubs. Egyptian shipwrights assembled large seagoing vessels from cedar and local woods for Red Sea expeditions to Punt; hulls were lashed or pegged and strengthened by internal framing. Steering oars, bipod or single masts, and square sails provided propulsion alongside rowers. Bronze tools permitted precise shaping of timbers and fastenings. Maritime construction fostered specialized ports, slipways, and navigational knowledge, enabling regional exchange systems and occasional naval actions by galley formations.",
    "image": "/media/images/technologyType/shipBuilding.jpg",
    "key": "technologyType:shipBuilding",
    "name": "Ship Building",
    "quote": {
      "text": "A well-built ship needs no oars.",
      "source": "Greek proverb, ca. 400 BCE",
      "url": "/media/quotes/technologyType/shipBuilding.mp3"
    },
    "requires": ["technologyType:mining"],
    "x": 2,
    "y": 18,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 66
      }
    ]
  },
  {
    "category": "eraType:bronze",
    "concept": "conceptType:technology",
    "description": "Writing matured in Bronze Age states as a central instrument of administration, ritual, and memory. In Mesopotamia, cuneiform impressed on clay recorded grain rations, contracts, diplomatic letters, and scholarly lists; standardized wedges and sign inventories were taught in scribal schools. Egypt developed hieroglyphic and hieratic scripts for monumental inscriptions, temple liturgy, and daily administration on papyrus and ostraca. Archives at cities such as Ebla and Mari reveal multilingual bureaucracy and treaty practice. Over time, script traditions diversified, producing Linear B for Mycenaean Greek and Hittite adaptations of cuneiform. Materials and media shaped practice: durable tablets preserved legal and economic data, while stone stelae broadcast royal decrees and commemorations. Writing supported taxation, land tenure, and distant trade, while also anchoring religious doctrine and royal ideology within monumental landscapes.",
    "image": "/media/images/technologyType/writing.jpg",
    "key": "technologyType:writing",
    "name": "Writing",
    "quote": {
      "text": "The spoken word dies; the written remains.",
      "source": "Egyptian proverb, ca. 1250 BCE",
      "url": "/media/quotes/technologyType/writing.mp3"
    },
    "requires": ["technologyType:irrigation"],
    "x": 8,
    "y": 18,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 66
      }
    ]
  },
  {
    "category": "eraType:lateBronze",
    "concept": "conceptType:technology",
    "description": "Celestial navigation in the classical world combined empirical star knowledge with simple sighting methods to guide coasting and open-water passages. Phoenician mariners steered by Polaris and circumpolar stars to maintain headings at night, supplementing daytime solar azimuths and wind patterns. Greek sailors used rising and setting points of prominent constellations and seasonal star calendars (parapegmata) to plan departures and routes. Angle estimation employed the hand, gnomons, and basic dioptras long before specialized nautical instruments. Latitude awareness grew from observing the elevation of known stars relative to the horizon, enabling ventures beyond familiar shorelines. Textual traditions linked to Hipparchus and later Ptolemy codified stellar positions and seasonal timings. This astronomical seamanship integrated with dead reckoning and pilotage, supporting Mediterranean trade networks and exploratory voyages such as those attributed to Pytheas.",
    "image": "/media/images/technologyType/celestialNavigation.jpg",
    "key": "technologyType:celestialNavigation",
    "name": "Celestial Navigation",
    "quote": {
      "text": "He who knows the stars will not lose his way.",
      "source": "Polynesian proverb, ca. 1800 CE",
      "url": "/media/quotes/technologyType/celestialNavigation.mp3"
    },
    "requires": ["technologyType:shipBuilding"],
    "x": 2,
    "y": 21,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 70
      }
    ]
  },
  {
    "category": "eraType:lateBronze",
    "concept": "conceptType:technology",
    "description": "Bronze smithing refined the alloying of copper with tin to produce hard, workable metal for tools, weapons, and prestige goods. Craftsmen mastered smelting, casting in stone or clay molds, and the lost-wax process for complex forms, then improved edges and resilience through hammering and annealing cycles. In classical contexts, Greek workshops produced helmets, cuirasses, and spearheads for hoplites, while Etruscan artisans made highly finished mirrors, cistae, and ritual vessels. Supply chains for tin, scarce in the Mediterranean, linked workshops to distant sources via maritime trade. Surface treatments, riveting, and soldering allowed composite assemblies and repairs. Bronze’s resistance to corrosion and ease of casting sustained its use for statues and architectural fittings even as iron edged tools became common. Guild-like traditions, apprenticeship, and specialized urban quarters maintained technical continuity and style.",
    "image": "/media/images/technologyType/bronzeSmithing.jpg",
    "key": "technologyType:bronzeSmithing",
    "name": "Bronze Smithing",
    "quote": {
      "text": "The smith’s hammer makes crowns and swords alike.",
      "source": "African proverb, ca. 1900",
      "url": "/media/quotes/technologyType/bronzeSmithing.mp3"
    },
    "requires": ["technologyType:shipBuilding", "technologyType:writing"],
    "x": 6,
    "y": 21,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 70
      }
    ]
  },
  {
    "category": "eraType:lateBronze",
    "concept": "conceptType:technology",
    "description": "Government in classical societies coordinated law, taxation, defense, and public works through formal offices and procedures. In Greek poleis, councils and assemblies such as the Athenian boule and ekklesia debated policy, while magistrates executed decrees and managed courts. The Roman Republic structured authority among annually elected magistrates, the Senate, and popular assemblies, balancing civic participation with aristocratic leadership. Imperial systems, exemplified by Achaemenid Persia, delegated power to satraps, standardized tribute, and supported road and courier networks. Record keeping, censuses, and territorial administration linked urban centers to rural producers. These institutions stabilized revenue, mobilized armies, and enforced legal norms across diverse populations.",
    "image": "/media/images/technologyType/government.jpg",
    "key": "technologyType:government",
    "name": "Government",
    "quote": {
      "text": "The king’s law holds where his sword cannot.",
      "source": "Babylonian proverb, ca. 1700 BCE",
      "url": "/media/quotes/technologyType/government.mp3"
    },
    "requires": ["technologyType:writing"],
    "x": 10,
    "y": 21,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 70
      }
    ]
  },
  {
    "category": "eraType:lateBronze",
    "concept": "conceptType:technology",
    "description": "Archery was a foundational military skill across classical Eurasia, serving both infantry and cavalry. Self bows of wood coexisted with powerful composite bows of horn, wood, and sinew crafted by specialist bowyers. The Achaemenid Persians fielded large archer contingents using massed volleys behind shields, while Scythian and other steppe peoples perfected mounted archery with short, reflex bows and hit-and-run tactics. Arrowheads of bronze and later iron were tailored for armor penetration or cutting wounds; quivers, wrist guards, and thumb rings equipped archers for sustained fire. Training emphasized draw strength, rapid shooting, and range estimation. In regions favoring heavy infantry, such as many Greek poleis, archers served as skirmishers and auxiliaries, yet remained decisive in sieges and open battles where mobility and missiles could disrupt dense formations.",
    "image": "/media/images/technologyType/archery.jpg",
    "key": "technologyType:archery",
    "name": "Archery",
    "quote": {
      "text": "The bow kills from afar.",
      "source": "Egyptian military text, ca. 1200 BCE",
      "url": "/media/quotes/technologyType/archery.mp3"
    },
    "requires": ["technologyType:celestialNavigation", "technologyType:bronzeSmithing"],
    "x": 4,
    "y": 23,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 80
      }
    ]
  },
  {
    "category": "eraType:lateBronze",
    "concept": "conceptType:technology",
    "description": "Organized religion in the classical era developed durable institutions, priesthoods, and ritual calendars that structured public and private life. Roman civic cults linked magistracies to sacrifice, festivals, and temple maintenance, binding community identity to state practice. The Achaemenid court supported Zoroastrian traditions and fire temples across provincial centers, while respecting local cults for imperial cohesion. In South Asia, Mauryan patronage under Ashoka promoted Buddhist monastic communities, edict inscriptions, and pilgrimage infrastructure. Canonized texts, liturgical languages, and trained clergy sustained doctrine across generations. Temples, shrines, and processions regulated sacred time and space, channeled donations, and legitimated political authority.",
    "image": "/media/images/technologyType/organizedReligion.jpg",
    "key": "technologyType:organizedReligion",
    "name": "Organized Religion",
    "quote": {
      "text": "Build a temple, and the god will listen.",
      "source": "Mesopotamian proverb, ca. 2000 BCE",
      "url": "/media/quotes/technologyType/organizedReligion.mp3"
    },
    "requires": ["technologyType:bronzeSmithing", "technologyType:government"],
    "x": 8,
    "y": 23,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 80
      }
    ]
  },
  {
    "category": "eraType:lateBronze",
    "concept": "conceptType:technology",
    "description": "Codes of law publicly articulated rules of procedure, property, family relations, and penalties to regularize justice. In the Roman Twelve Tables, provisions were inscribed for consultation by citizens, curbing magistrates’ discretion and establishing due process norms. The Code of Gortyn in Crete recorded detailed regulations on marriage, inheritance, slavery, and fines on a wall in the city. Publication on stone or bronze enabled reference and teaching in courts and assemblies. Codification stabilized precedent, guided magistrates and jurors, and clarified rights across communities. Written law also facilitated administration in colonies and federations by providing portable standards for adjudication.",
    "image": "/media/images/technologyType/codeOfLaw.jpg",
    "key": "technologyType:codeOfLaw",
    "name": "Code of Law",
    "quote": {
      "text": "Let justice be seen throughout the land.",
      "source": "Code of Hammurabi, ca. 1750 BCE",
      "url": "/media/quotes/technologyType/codeOfLaw.mp3"
    },
    "requires": ["technologyType:government"],
    "x": 12,
    "y": 23,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 80
      }
    ]
  },
  {
    "category": "eraType:lateBronze",
    "concept": "conceptType:technology",
    "description": "Military training in classical states standardized discipline, formation movement, and weapons handling. The Spartan agoge conditioned youths through endurance regimens, close-order drill, and communal living to sustain phalanx cohesion. Roman legionary practice emphasized daily marching, fortified camp construction, javelin and sword exercises with weighted equipment, and strict penalties and rewards. Training grounds and instructors institutionalized tactics, from hoplite spearwork to manipular flexibility and later cohort maneuvers. Regular drill improved unit coordination, logistics, and rapid fortification, enabling long campaigns. Systems of rotation, pay, and veterans’ settlements reinforced retention of skills and military culture across generations.",
    "image": "/media/images/technologyType/militaryTraining.jpg",
    "key": "technologyType:militaryTraining",
    "name": "Military Training",
    "quote": {
      "text": "Discipline is the mother of victory.",
      "source": "Greek proverb, ca. 400 BCE",
      "url": "/media/quotes/technologyType/militaryTraining.mp3"
    },
    "requires": ["technologyType:archery"],
    "x": 2,
    "y": 25,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 90
      }
    ]
  },
  {
    "category": "eraType:lateBronze",
    "concept": "conceptType:technology",
    "description": "Classical artisans used bronze casting to produce durable statues, vessels, tools, and fittings with precise detail. The dominant method was lost‑wax casting. A wax model over a clay core received sprues and vents, then was enclosed in an investment mold and fired to remove the wax. Molten copper‑tin alloy, often 8–12% tin, was poured to form hollow or solid castings. Large works were cast in sections, joined by brazing or mechanical fasteners, then finished by chasing, inlay, and gilding. Greek workshops mastered life‑size and over‑life‑size figures, as seen in the Riace Bronzes. Etruscan founders produced refined candelabra, mirrors, and votive figures for domestic and ritual use. Casting supplied standardized fittings for ships, chariots, and architecture, and small parts for armor. The process supported replication through reusable molds, yet allowed unique surface modeling through wax. The technique spread across the Mediterranean through trade in metals and skilled labor.",
    "image": "/media/images/technologyType/bronzeCasting.jpg",
    "key": "technologyType:bronzeCasting",
    "name": "Bronze Casting",
    "quote": {
      "text": "Once cast, bronze keeps its shape forever.",
      "source": "Chinese proverb, ca. 300 BCE",
      "url": "/media/quotes/technologyType/bronzeCasting.mp3"
    },
    "requires": ["technologyType:archery", "technologyType:organizedReligion"],
    "x": 6,
    "y": 25,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 90
      }
    ]
  },
  {
    "category": "eraType:lateBronze",
    "concept": "conceptType:technology",
    "description": "Classical currency standardized value for exchange, taxation, and military pay. States issued coinage in precious metals on regulated weight standards, struck with dies to confirm authority and fineness. Silver issues dominated many markets. The Athenian drachma became a widely accepted medium through maritime trade and tribute systems. In the western Mediterranean, the Roman denarius provided a stable unit for contracts, provisioning, and soldier stipends. Coins moved across borders in bulk, easing accounting and price comparison. Hoards record crises, reforms, and regional circulation. Civic mints adjusted denominations to meet fiscal needs, while debasement and recoinage tracked political change. Currency integrated local markets into larger commercial networks.",
    "image": "/media/images/technologyType/currency.jpg",
    "key": "technologyType:currency",
    "name": "Currency",
    "quote": {
      "text": "Silver buys more than a thousand speeches.",
      "source": "Persian proverb, ca. 500 BCE",
      "url": "/media/quotes/technologyType/currency.mp3"
    },
    "requires": ["technologyType:organizedReligion", "technologyType:codeOfLaw"],
    "x": 10,
    "y": 25,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 90
      }
    ]
  },
  {
    "category": "eraType:iron",
    "concept": "conceptType:technology",
    "description": "Riding in the classical era enabled rapid travel, communication, and shock or missile combat. Horsemen used bits, bridles, pads, and early saddles without stirrups, relying on skilled seat and reins. Cavalry evolved distinct roles: scouts, skirmishers, and lancers. Achaemenid armies fielded massed cavalry, with archers delivering volleys at range. Macedonian Companion Cavalry used close‑order charges that exploited speed and cohesion to disrupt infantry lines. Camels served in arid regions for patrol, trade, and limited combat, offering endurance and height. Remount systems and waystations supported couriers and imperial administration. Training emphasized control at speed, formation changes, and coordinated maneuvers with infantry. Riding reshaped campaign tempo, extended supply lines, and deepened state reach across steppe margins, deserts, and mountainous frontiers.",
    "image": "/media/images/technologyType/riding.jpg",
    "key": "technologyType:riding",
    "name": "Riding",
    "quote": {
      "text": "A horse! A horse! My kingdom for a horse!",
      "source": "William Shakespeare, Richard III, 1594",
      "url": "/media/quotes/technologyType/riding.mp3"
    },
    "requires": ["technologyType:militaryTraining"],
    "x": 0,
    "y": 28,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 100
      }
    ]
  },
  {
    "category": "eraType:iron",
    "concept": "conceptType:technology",
    "description": "Classical iron working converted ore into wrought iron blooms in charcoal‑fired bloomeries. Smiths consolidated and forged blooms to remove slag, then shaped tools, weapons, nails, and fittings. Carburizing produced steel edges for blades and chisels, followed by quenching and tempering to balance hardness and toughness. The Celtic La Tène tradition advanced sword forms, scabbards, and decorative fittings. Roman production scaled through mining, water‑powered bellows in some regions, and standardized output for legions and infrastructure. Iron nails, clamps, and tools underpinned shipbuilding, carpentry, masonry, and agriculture. Chain mail, helmet components, and siege hardware relied on repeatable forging routines. Slag heaps and smithies mark sustained, regional industries near ore and charcoal supplies. Iron’s abundance and repairability made it the foundational metal for classical economies.",
    "image": "/media/images/technologyType/ironWorking.jpg",
    "key": "technologyType:ironWorking",
    "name": "Iron Working",
    "quote": {
      "text": "The land of iron rules over the men of bronze.",
      "source": "Assyrian inscription, ca. 800 BCE",
      "url": "/media/quotes/technologyType/ironWorking.mp3"
    },
    "requires": ["technologyType:militaryTraining", "technologyType:bronzeCasting"],
    "x": 4,
    "y": 28,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 100
      }
    ]
  },
  {
    "category": "eraType:iron",
    "concept": "conceptType:technology",
    "description": "Classical ship engineering optimized hulls, rigs, and oar systems for speed, endurance, and maneuver. Mediterranean builders used shell‑first construction with pegged mortise‑and‑tenon joints, creating strong, fair hulls. The Athenian trireme arranged three tiers of oars with carefully calculated spacing, lightweight timbers, and a projecting ram for naval combat. Carthaginian craftsmen developed larger polyremes, including the quinquereme, balancing power, crew capacity, and structural reinforcement. Square sails provided propulsion on open water, while steering oars delivered control. Careened hulls and sheathing limited fouling. Standardized gear—anchors, pumps, and cordage—improved reliability. Dockyards orchestrated rapid builds and refits for fleets. These innovations supported grain convoys, troop movements, and maritime hegemony, linking islands, river mouths, and ports across the Mediterranean and beyond.",
    "image": "/media/images/technologyType/shipEngineering.jpg",
    "key": "technologyType:shipEngineering",
    "name": "Ship Engineering",
    "quote": {
      "text": "He who builds ships rules far shores.",
      "source": "Carthaginian proverb, ca. 500 BCE",
      "url": "/media/quotes/technologyType/shipEngineering.mp3"
    },
    "requires": ["technologyType:bronzeCasting", "technologyType:currency"],
    "x": 8,
    "y": 28,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 100
      }
    ]
  },
  {
    "category": "eraType:iron",
    "concept": "conceptType:technology",
    "description": "Classical sports covered ritual festivals, civic training, and mass entertainment. Greek city-states staged the Olympic, Pythian, Nemean, and Isthmian games with running, wrestling, pankration, and chariot races. Victors received crowns, pensions, and public honors. Gymnasia trained youths for warfare and competition under codified rules. Rome emphasized spectacles in circuses and amphitheaters. Chariot factions filled the Circus Maximus, while athletic displays accompanied imperial ceremonies. Patronage by elites and cities funded venues and prizes. Competitions reinforced calendars, identities, and diplomacy among communities. Regulation, judges, and heralds maintained order and timing.",
    "image": "/media/images/technologyType/sports.jpg",
    "key": "technologyType:sports",
    "name": "Sports",
    "quote": {
      "text": "Victory belongs to the diligent, not the well-born.",
      "source": "Olympic inscription, ca. 300 BCE",
      "url": "/media/quotes/technologyType/sports.mp3"
    },
    "requires": ["technologyType:currency"],
    "x": 12,
    "y": 28,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 100
      }
    ]
  },
  {
    "category": "eraType:iron",
    "concept": "conceptType:technology",
    "description": "Classical alphabets encoded speech through a fixed set of letters, enabling flexible writing and rapid learning. Greeks adapted the Phoenician script and introduced vowel letters, improving phonetic accuracy across dialects. Early inscriptions, such as the Duenos inscription in Latin, display local variants that later converged. The Greek and Latin alphabets spread with colonization, trade, and administration, appearing on stone, pottery, papyrus, and metal. Alphabetic writing supported law codes, drama, philosophy, and commerce by reducing copying costs and aiding record‑keeping. Its modular design encouraged literacy across diverse communities and domains.",
    "image": "/media/images/technologyType/alphabet.jpg",
    "key": "technologyType:alphabet",
    "name": "Alphabet",
    "quote": {
      "text": "The Phoenicians taught us letters.",
      "source": "Herodotus, Histories, ca. 440 BCE",
      "url": "/media/quotes/technologyType/alphabet.mp3"
    },
    "requires": ["technologyType:riding", "technologyType:ironWorking"],
    "x": 2,
    "y": 30,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 112
      }
    ]
  },
  {
    "category": "eraType:iron",
    "concept": "conceptType:technology",
    "description": "Classical philosophy pursued systematic inquiry into knowledge, nature, and ethics. Socrates advanced dialectical questioning to examine virtue and civic duty. Plato founded the Academy, treating metaphysics, mathematics, and political order. Aristotle’s Lyceum developed logic, natural philosophy, and empirical method, compiling research across biology, rhetoric, and ethics. Hellenistic schools extended these projects: Stoics framed ethics through reason and fate; Epicureans sought tranquility through measured desire; Skeptics scrutinized claims to certainty. Philosophical curricula shaped education, law, and science in later eras, transmitting argumentative techniques and classifications essential to scholarly practice.",
    "image": "/media/images/technologyType/philosophy.jpg",
    "key": "technologyType:philosophy",
    "name": "Philosophy",
    "quote": {
      "text": "He who conquers himself is mightier than he who conquers a city.",
      "source": "Zhuangzi, ca. 300 BCE",
      "url": "/media/quotes/technologyType/philosophy.mp3"
    },
    "requires": ["technologyType:ironWorking", "technologyType:shipEngineering"],
    "x": 6,
    "y": 30,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 112
      }
    ]
  },
  {
    "category": "eraType:iron",
    "concept": "conceptType:technology",
    "description": "Classical drama fused poetry, music, and performance within civic festivals. In Athens, tragedies by Aeschylus, Sophocles, and Euripides examined myth, law, and fate through actors, chorus, and masks on the open‑air stage. Aristophanes’ comedies used satire and topical commentary at the Dionysia. Playwrights composed for competition, with choruses trained at public expense and roles assigned to citizen actors. Theaters with stone seating and orchestra pits shaped acoustics and sightlines. Scripts circulated across the Greek world and later informed Roman adaptations. Drama served education, ritual, and debate, offering shared narratives that tested civic values and political choices.",
    "image": "/media/images/technologyType/drama.jpg",
    "key": "technologyType:drama",
    "name": "Drama",
    "quote": {
      "text": "Through the mask, truth is spoken.",
      "source": "Greek proverb, ca. 400 BCE",
      "url": "/media/quotes/technologyType/drama.mp3"
    },
    "requires": ["technologyType:shipEngineering", "technologyType:sports"],
    "x": 10,
    "y": 30,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 112
      }
    ]
  },
  {
    "category": "eraType:iron",
    "concept": "conceptType:technology",
    "description": "Classical arches used wedge-shaped stone voussoirs set over wooden centering and locked by a keystone to redirect vertical loads into lateral thrust carried by piers or abutments. Builders employed stone, brick, and Roman concrete, enabling durable spans in bridges, aqueduct arcades, gates, drains, and vaulted substructures. Repeated arches formed arcades and supported barrel and groin vaults, extending the technique into large interior spaces. Construction required precise stone cutting, mortar bonding, and careful foundation work to resist spreading forces. Roman military engineers and state-sponsored projects standardized arch use across roads and water systems, allowing infrastructure to cross rivers, valleys, and uneven terrain while supporting urban expansion, logistics, and monumentality.",
    "image": "/media/images/technologyType/arches.jpg",
    "key": "technologyType:arches",
    "name": "Arches",
    "quote": {
      "text": "Build so it endures.",
      "source": "Vitruvius, 15 BCE",
      "url": "/media/quotes/technologyType/arches.mp3"
    },
    "requires": ["technologyType:philosophy", "technologyType:alphabet"],
    "x": 4,
    "y": 32,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 124
      }
    ]
  },
  {
    "category": "eraType:iron",
    "concept": "conceptType:technology",
    "description": "Classical mathematics organized proof‑based knowledge across geometry, arithmetic, and mechanics. Euclid’s Elements codified axioms, propositions, and rigorous demonstrations that structured later study. Eudoxus developed proportion theory, enabling work with magnitudes and incommensurables. Archimedes advanced methods for calculating areas, volumes, and centers of gravity, linking geometry to hydrostatics and simple machines. Astronomers applied geometry to planetary models and calendrics. Surveyors and engineers used practical algorithms for land division, construction, and siegecraft. Manuscript transmission in Alexandria and beyond preserved texts that framed mathematical reasoning for subsequent traditions.",
    "image": "/media/images/technologyType/mathematics.jpg",
    "key": "technologyType:mathematics",
    "name": "Mathematics",
    "quote": {
      "text": "Without measure, there is no knowledge.",
      "source": "Indian mathematical treatise, ca. 300 BCE",
      "url": "/media/quotes/technologyType/mathematics.mp3"
    },
    "requires": ["technologyType:philosophy", "technologyType:drama"],
    "x": 8,
    "y": 32,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 124
      }
    ]
  },
  {
    "category": "eraType:classical",
    "concept": "conceptType:technology",
    "description": "Iron smithing in the classical world refined bloomery iron into tools, weapons, and fittings. Workers reheated spongy blooms, hammered out slag, and forged bars. Techniques included carburization at the surface, quenching, and tempering to balance hardness with toughness. Specialized shops produced blades, spear and pilum heads, nails, hinges, and agricultural implements. Roman armies relied on standardized iron parts for armor and fortification hardware. Greek and Etruscan towns hosted workshops tied to local ore and charcoal supplies. Trade moved billets and finished goods across the Mediterranean. Production left large slag heaps near furnaces and water-powered hammers in later periods. Quality varied with control of carbon and impurities. True steel was rare; smiths often welded steely edges onto softer cores. The craft supported urban construction, farming, and warfare, and its organization ranged from itinerant smiths to state-backed fabricae in the Roman Empire.",
    "image": "/media/images/technologyType/ironSmithing.jpg",
    "key": "technologyType:ironSmithing",
    "name": "Iron Smithing",
    "quote": {
      "text": "Strike while the iron is hot.",
      "source": "Geoffrey Chaucer, 1386",
      "url": "/media/quotes/technologyType/ironSmithing.mp3"
    },
    "requires": ["technologyType:arches"],
    "x": 2,
    "y": 35,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 130
      }
    ]
  },
  {
    "category": "eraType:classical",
    "concept": "conceptType:technology",
    "description": "Classical construction combined stone masonry, timber framing, and concrete to create durable infrastructure and monuments. Greek builders used precisely cut marble and limestone with post-and-lintel systems, refined entasis, and careful jointing. Romans expanded the toolkit with pozzolanic concrete, arches, vaults, and domes. Surveyors laid out roads with standardized layers, camber, and drainage. Aqueducts carried water across valleys on arcades calibrated for gentle gradients. Large projects such as the Colosseum integrated travertine, brick, and concrete with iron cramps and lime mortar. Organization relied on skilled guilds, enslaved labor, and military detachments. Tools included plumb lines, gromas, chorobates, pulleys, and treadwheel cranes. The result was a network of roads, bridges, baths, and temples that sustained urban life and imperial logistics.",
    "image": "/media/images/technologyType/construction.jpg",
    "key": "technologyType:construction",
    "name": "Construction",
    "quote": {
      "text": "Stretch the cord by the stars; set the temple true.",
      "source": "Egyptian foundation ritual, ca. 1200 BCE",
      "url": "/media/quotes/technologyType/construction.mp3"
    },
    "requires": ["technologyType:arches", "technologyType:mathematics"],
    "x": 6,
    "y": 35,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 130
      }
    ]
  },
  {
    "category": "eraType:classical",
    "concept": "conceptType:technology",
    "description": "Classical democracy vested authority in the citizen body through assemblies, councils, and large juries. In Athens, Cleisthenes’ reforms reorganized tribes and established institutions that enabled broad participation. The Assembly set policy, while lottery assigned many offices to limit factional control. Under Pericles, pay for jury and civic service widened access. Legal procedures, ostracism, and public scrutiny structured accountability. Other poleis experimented with mixed constitutions that combined popular and elite elements. Democratic practice depended on military service, taxation, and civic festivals, tying governance to social obligations. Debates over citizenship and empire shaped its limits and legacy.",
    "image": "/media/images/technologyType/democracy.jpg",
    "key": "technologyType:democracy",
    "name": "Democracy",
    "quote": {
      "text": "All may speak, but few are heard.",
      "source": "Athenian proverb, ca. 400 BCE",
      "url": "/media/quotes/technologyType/democracy.mp3"
    },
    "requires": ["technologyType:mathematics"],
    "x": 10,
    "y": 35,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 130
      }
    ]
  },
  {
    "category": "eraType:classical",
    "concept": "conceptType:technology",
    "description": "Minting in antiquity produced standardized coins for market exchange, taxation, and military pay. Lydia issued early electrum staters in the 7th–6th centuries BCE, introducing stamped weights and official authority. Greek mints adopted silver standards; the Athenian tetradrachm became a widely trusted trade coin. Roman mints developed a diversified system in gold, silver, and bronze, with the denarius as a core unit. Production prepared metal flans by casting or cutting, heated them, then struck designs between engraved dies with a hammer. Control of alloy purity and weight maintained confidence and enabled fiscal policy. States opened multiple mints to supply armies and provinces. Recoinage, debasement, and counterfeiting were persistent issues. Iconography communicated issuing city or ruler, but the legal value rested on metal content and state guarantee. Minting tied monetary circulation to administration and long-distance commerce.",
    "image": "/media/images/technologyType/minting.jpg",
    "key": "technologyType:minting",
    "name": "Minting",
    "quote": {
      "text": "Coin proclaims the power of the city.",
      "source": "Greek proverb, ca. 300 BCE",
      "url": "/media/quotes/technologyType/minting.mp3"
    },
    "requires": ["technologyType:ironSmithing", "technologyType:construction"],
    "x": 4,
    "y": 37,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 144
      }
    ]
  },
  {
    "category": "eraType:classical",
    "concept": "conceptType:technology",
    "description": "Classical public works organized state-directed construction of roads, aqueducts, sewers, harbors, walls, and civic buildings to support urban life, sanitation, defense, and administration. Magistrates such as Roman censors and aediles oversaw planning, contracting, and maintenance, while military engineers, skilled laborers, and conscripted or enslaved workers carried out construction using standardized methods in stone, brick, and concrete. Road networks employed graded surfaces, drainage, and milestones to regulate movement and communication, while aqueducts and sewers managed water supply and waste removal. These projects required taxation, legal authority, and logistical coordination across regions, allowing governments to sustain population density, facilitate trade and military deployment, and express civic order and state capacity through durable shared infrastructure.",
    "image": "/media/images/technologyType/publicWorks.jpg",
    "key": "technologyType:publicWorks",
    "name": "Public Works",
    "quote": {
      "text": "The welfare of the people shall be the supreme law.",
      "source": "Cicero, 52 BCE",
      "url": "/media/quotes/technologyType/publicWorks.mp3"
    },
    "requires": ["technologyType:construction", "technologyType:democracy"],
    "x": 8,
    "y": 37,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 144
      }
    ]
  },
  {
    "category": "eraType:classical",
    "concept": "conceptType:technology",
    "description": "Classical standing armies maintained permanent, state-supported forces of trained infantry, cavalry, and specialists under centralized command, replacing temporary levies with long-term service, standardized equipment, and regular discipline. States such as Achaemenid Persia, Hellenistic kingdoms, and later Rome organized units into fixed formations with defined ranks, pay, and supply systems sustained through taxation and administrative oversight. Soldiers trained in coordinated drill, formation maneuver, and siege operations, while officers enforced hierarchy, logistics, and battlefield control. Permanent garrisons secured frontiers, suppressed revolt, and protected infrastructure and rulers. This institutionalization of military service enabled sustained campaigns, territorial control, and projection of authority, tying military power directly to state organization and political stability.",
    "image": "/media/images/technologyType/standingArmy.jpg",
    "key": "technologyType:standingArmy",
    "name": "Standing Army",
    "quote": {
      "text": "He who wishes for peace must prepare for war.",
      "source": "Vegetius, ca. 400 CE",
      "url": "/media/quotes/technologyType/standingArmy.mp3"
    },
    "requires": ["technologyType:minting"],
    "x": 2,
    "y": 39,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 158
      }
    ]
  },
  {
    "category": "eraType:classical",
    "concept": "conceptType:technology",
    "description": "Iron casting reached sophisticated levels in ancient China during the Warring States and Han periods. High-temperature furnaces produced liquid cast iron that workers poured into clay or sand molds. The process enabled mass production of plowshares, cauldrons, weights, and architectural fittings with consistent dimensions. Foundries used piece-mold techniques and core supports to create hollow forms. Because cast iron is hard and brittle, artisans developed fining and decarburization to convert it into malleable iron when needed. State arsenals and private workshops supplied standardized parts for agriculture, transport, and warfare. Cast components appeared in tools, coinage equipment, and building hardware. In the Mediterranean, bloomery technology dominated and true cast iron was rare until the later Middle Ages. Chinese mastery of casting linked metallurgical control of carbon with large-scale industrial organization and fuel management.",
    "image": "/media/images/technologyType/ironCasting.jpg",
    "key": "technologyType:ironCasting",
    "name": "Iron Casting",
    "quote": {
      "text": "Cast metal makes a bell, forged iron makes a blade.",
      "source": "Huainanzi, 139 BCE",
      "url": "/media/quotes/technologyType/ironCasting.mp3"
    },
    "requires": ["technologyType:minting", "technologyType:publicWorks"],
    "x": 6,
    "y": 39,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 158
      }
    ]
  },
  {
    "category": "eraType:classical",
    "concept": "conceptType:technology",
    "description": "Classical wood composites combined layers, fibers, and adhesives to improve strength-to-weight and resilience. Shield makers laminated thin planks with animal glue, oriented grains crosswise, and faced surfaces with leather or canvas. Roman scuta used curved, multi-ply cores that resisted impact and flexed without breaking. Shipwrights applied layered planking and internal reinforcements to hulls and rams, enhancing stiffness under oar and sail loads. Composite oars balanced elasticity and durability for sustained rowing. Adhesives included hide glue, fish glue, and resinous pitches; bindings with linen or sinew added tensile strength. The approach economized scarce large timbers and allowed complex shapes. Maintenance involved drying, re-gluing, and clamping to prevent delamination in damp service.",
    "image": "/media/images/technologyType/woodComposites.jpg",
    "key": "technologyType:woodComposites",
    "name": "Wood Composites",
    "quote": {
      "text": "One beam cannot hold up a house.",
      "source": "Chinese proverb",
      "url": "/media/quotes/technologyType/woodComposites.mp3"
    },
    "requires": ["technologyType:publicWorks"],
    "x": 10,
    "y": 39,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 158
      }
    ]
  },
  {
    "category": "eraType:medieval",
    "concept": "conceptType:technology",
    "description": "Medieval steel denoted iron-carbon alloys hardened by carburization and heat treatment. Sources included bloomery iron enriched in charcoal-packed boxes (cementation), crucible steels such as Indian wootz traded into the Islamic world, and refined products from hearths and fineries. Smiths forged, quenched, and tempered edges to combine sharpness with toughness. Pattern welding persisted for blades where uniform high-carbon stock was scarce. In Europe, high-quality swords bearing the Ulfberht name suggest access to superior steel and skilled heat control. In the Middle East, Damascus blades made from wootz showed distinctive watered patterns and excellent cutting performance. In Japan, tamahagane from tatara furnaces was folded and differentially hardened to produce hard edges and resilient spines. Steel improved armor plates, tools, saws, and springs, and it shaped military and craft productivity across Eurasia.",
    "image": "/media/images/technologyType/steel.jpg",
    "key": "technologyType:steel",
    "name": "Steel",
    "quote": {
      "text": "Steel bends to no coward's hand.",
      "source": "Norse warrior proverb, ca. 1000",
      "url": "/media/quotes/technologyType/steel.mp3"
    },
    "requires": ["technologyType:standingArmy", "technologyType:ironCasting"],
    "x": 2,
    "y": 42,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 160
      }
    ]
  },
  {
    "category": "eraType:medieval",
    "concept": "conceptType:technology",
    "description": "Feudalism is a modern term for medieval arrangements where landholding, protection, and service formed a layered hierarchy. Lords granted fiefs to vassals, who owed counsel, military aid, and dues. In Capetian France and Anglo-Norman realms, homage, fealty, and castle obligations structured power. In Japan’s Kamakura period, samurai vassalage tied estates and military service to the shogunate. These systems varied by region and era, mixing customary law, charters, and personal bonds. They supported mounted warfare, castle networks, and local justice, while constraining central taxation. Over time, monetization and bureaucratic courts reshaped obligations into rents and offices.",
    "image": "/media/images/technologyType/feudalism.jpg",
    "key": "technologyType:feudalism",
    "name": "Feudalism",
    "quote": {
      "text": "Loyalty to the lord binds stronger than blood.",
      "source": "Samurai oath, Kamakura period, ca. 1200",
      "url": "/media/quotes/technologyType/feudalism.mp3"
    },
    "requires": ["technologyType:ironCasting", "technologyType:woodComposites"],
    "x": 6,
    "y": 42,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 160
      }
    ]
  },
  {
    "category": "eraType:medieval",
    "concept": "conceptType:technology",
    "description": "Early medieval guilds organized artisans and merchants into recognized associations that regulated production, training, and trade within towns and emerging urban economies. Members shared standards for quality, tools, and methods, while masters supervised workshops employing apprentices and journeymen under customary rules governing advancement and conduct. Guild statutes controlled prices, weights, and access to markets, and authorities granted privileges such as monopolies over specific crafts in return for taxes, service, or civic obligations. Guilds also maintained mutual aid, religious observances, and collective representation before municipal or lordly officials. This structure stabilized skilled production, supported urban growth, and integrated economic activity with local governance and social order.",
    "image": "/media/images/technologyType/guilds.jpg",
    "key": "technologyType:guilds",
    "name": "Guilds",
    "quote": {
      "text": "Each craft shall have its proper rules and masters.",
      "source": "Étienne Boileau, 1268",
      "url": "/media/quotes/technologyType/guilds.mp3"
    },
    "requires": ["technologyType:woodComposites"],
    "x": 10,
    "y": 42,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 160
      }
    ]
  },
  {
    "category": "eraType:medieval",
    "concept": "conceptType:technology",
    "description": "Medieval engineering applied geometry and mechanics to raise cathedrals, manage water, and wage siege. Master masons designed ribbed vaults and flying buttresses that channelled thrust to piers, enabling tall naves and large windows. Carpenters built scaffolds, centering, and roof trusses with precise joinery. Millwrights expanded watermill and windmill use, adding cams, cranks, and gear trains for grinding, fulling, and hammering. Artillery specialists refined counterweight trebuchets with calibrated sling lengths and release angles. Treatises by Villard de Honnecourt and Jordanus de Nemore documented practice and theory. In the Islamic world, al‑Jazari described automata, pumps, and control mechanisms. Surveying instruments, modular measures, and guild organization supported repeatable construction. Later centuries saw weight-driven clocks and improved metalworking, laying groundwork for early modern mechanics.",
    "image": "/media/images/technologyType/engineering.jpg",
    "key": "technologyType:engineering",
    "name": "Engineering",
    "quote": {
      "text": "No fine tower stands without strong foundations.",
      "source": "Medieval Latin architectural saying, ca. 1300",
      "url": "/media/quotes/technologyType/engineering.mp3"
    },
    "requires": ["technologyType:steel", "technologyType:feudalism"],
    "x": 4,
    "y": 44,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 176
      }
    ]
  },
  {
    "category": "eraType:medieval",
    "concept": "conceptType:technology",
    "description": "Crop rotation in the medieval period was a managed sequence of plantings designed to maintain soil fertility and stable yields. The three-field system spread across northern Europe from the ninth to thirteenth centuries. One field bore autumn-sown cereals, a second spring grains or legumes, and a third lay fallow. Legumes fixed nitrogen, reducing nutrient depletion and improving fodder. Fallow scheduling allowed weed control and grazing that recycled manure. Manorial accounts record rising output and more reliable harvests under the system. Islamic agronomic texts and local practice also promoted multi-year rotations in Iberia and Sicily. Rotations supported population growth by increasing the cropped area and diversifying diets. They enabled heavier plough use and larger draft herds by supplying feed. Notable forms included legume-intensive sequences and reforms that shortened or reorganized fallow. The system endured into early modern agriculture until enclosed fields and new rotations displaced it.",
    "image": "/media/images/technologyType/cropRotation.jpg",
    "key": "technologyType:cropRotation",
    "name": "Crop Rotation",
    "quote": {
      "text": "Let the land rest every seventh year, and it will reward you in time.",
      "source": "Leviticus 25:4, ca. 700 BCE",
      "url": "/media/quotes/technologyType/cropRotation.mp3"
    },
    "requires": ["technologyType:feudalism", "technologyType:guilds"],
    "x": 8,
    "y": 44,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 176
      }
    ]
  },
  {
    "category": "eraType:medieval",
    "concept": "conceptType:technology",
    "description": "Medieval machinery combined gears, shafts, and transmission linkages to convert natural or stored energy into useful work. Watermills and windmills provided rotary power to grind grain, full cloth, saw timber, and drive hammer heads. The cam, crank, and connecting rod converted rotation to reciprocating motion in bell-ringing frames and trip-hammers. Precision clockmaking advanced after the invention of the mechanical escapement, enabling weight-driven astronomical clocks that regulated motion with verge and foliot assemblies. Artisans drew on craft traditions recorded by authors such as Villard de Honnecourt in Latin Europe and Ibn al-Jazari in the Islamic world. Monastic estates and urban workshops spread these devices across rivers, town walls, and mines. Mechanization increased output and standardized processes, especially in metallurgy and textiles. Surviving examples include monumental clockworks, water-powered hammer mills, and automated bell mechanisms that marked civic time and religious observance.",
    "image": "/media/images/technologyType/machinery.jpg",
    "key": "technologyType:machinery",
    "name": "Machinery",
    "quote": {
      "text": "Water labors while men rest.",
      "source": "Al-Jazari, 1206",
      "url": "/media/quotes/technologyType/machinery.mp3"
    },
    "requires": ["technologyType:engineering"],
    "x": 2,
    "y": 46,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 192
      }
    ]
  },
  {
    "category": "eraType:medieval",
    "concept": "conceptType:technology",
    "description": "Castles were fortified residences that anchored seigneurial power and protected key routes. Early forms used timber mottes and baileys. From the twelfth century stone keeps, curtain walls, and gatehouses became standard. Designers added towers for flanking fire, arrow slits, hoardings, and later machicolations. Concentric plans layered defenses to absorb sieges. Garrisoned castles stored food, managed courts, and collected dues. They supported field armies and controlled bridges, ports, and passes. Notable examples include Krak des Chevaliers, the Tower of London, and the walls of Carcassonne. Siege artillery and gunpowder changed requirements in the fifteenth century. Many castles were adapted or eclipsed by lower, thicker trace italienne forts. Others shifted toward palatial residence while retaining administrative and jurisdictional roles.",
    "image": "/media/images/technologyType/castles.jpg",
    "key": "technologyType:castles",
    "name": "Castles",
    "quote": {
      "text": "He who holds the gate holds the realm.",
      "source": "German medieval proverb, ca. 1300",
      "url": "/media/quotes/technologyType/castles.mp3"
    },
    "requires": ["technologyType:engineering", "technologyType:cropRotation"],
    "x": 6,
    "y": 46,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 192
      }
    ]
  },
  {
    "category": "eraType:medieval",
    "concept": "conceptType:technology",
    "description": "Chivalry was a knightly code that shaped conduct in war, lordship, and sociability. It stressed loyalty to one's lord, courage under arms, and the defense of the Church. Courtly literature, including chansons de geste and romances, promoted models of prowess and courtesy. Tournament rules and heraldic customs regulated displays of skill and lineage. Crusading vows framed service as both martial and penitential. Jurists and preachers debated limits on violence against noncombatants and clergy. Practice varied by region and time, and real warfare often ignored ideals. Yet the code influenced aristocratic education, legal privileges, and the ritual of knighthood across Latin Christendom.",
    "image": "/media/images/technologyType/chivalry.jpg",
    "key": "technologyType:chivalry",
    "name": "Chivalry",
    "quote": {
      "text": "Strength to protect, honor to serve.",
      "source": "French chivalric motto, ca. 1400",
      "url": "/media/quotes/technologyType/chivalry.mp3"
    },
    "requires": ["technologyType:cropRotation"],
    "x": 10,
    "y": 46,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 192
      }
    ]
  },
  {
    "category": "eraType:renaissance",
    "concept": "conceptType:technology",
    "description": "Clinker, or lapstrake, construction fastened overlapping strakes along a light frame to form strong and flexible wooden hulls. Edge-riveted planks created longitudinal stiffness while allowing the shell to work in heavy seas. The method excelled for surf launching and shoal waters, common in the North Atlantic. Viking longships such as Gokstad and Oseberg used clinker hulls for speed, shallow draft, and beaching. From the thirteenth century, Hanseatic cogs adapted clinker sides to broad, capacious trading craft. Caulking with animal hair and tar sealed seams. Builders later combined clinker topsides with carvel bottoms or shifted entirely to carvel for larger artillery-bearing ships. North Sea traders continued clinker practice into the early modern era.",
    "image": "/media/images/technologyType/clinkerHulls.jpg",
    "key": "technologyType:clinkerHulls",
    "name": "Clinker Hulls",
    "quote": {
      "text": "Fair is the ship, fast is the seam.",
      "source": "Old Norse proverb, ca. 1200",
      "url": "/media/quotes/technologyType/clinkerHulls.mp3"
    },
    "requires": ["technologyType:machinery"],
    "x": 0,
    "y": 49,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 200
      }
    ]
  },
  {
    "category": "eraType:renaissance",
    "concept": "conceptType:technology",
    "description": "Medieval steel smithing refined iron into controlled carbon alloys and then shaped them through forging and heat treatment. Smiths carburized bloomery iron in packed charcoal, welded composite billets, and forged blades that combined hard edges with tough cores. Pattern-welding persisted in early centuries before purer monosteels spread. Quenching in water or oil locked in hardness; tempering at measured colors reduced brittleness. Workshops in Solingen, Toledo, Damascus, and along the Volga traded steels and techniques. Armorers produced tempered plate harnesses, helmets, and mail using differential heat treatment and precise riveting. Blade makers developed grind profiles and fullers to balance strength and flexibility. Marks such as Ulfberht signaled quality and consistent carbon content. The craft supported military change by supplying reliable edged weapons, springs, tools, and later firearm components.",
    "image": "/media/images/technologyType/steelSmithing.jpg",
    "key": "technologyType:steelSmithing",
    "name": "Steel Smithing",
    "quote": {
      "text": "Strike true, and the steel remembers.",
      "source": "Forging saying, ca. 1600",
      "url": "/media/quotes/technologyType/steelSmithing.mp3"
    },
    "requires": ["technologyType:machinery", "technologyType:castles"],
    "x": 4,
    "y": 49,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 200
      }
    ]
  },
  {
    "category": "eraType:renaissance",
    "concept": "conceptType:technology",
    "description": "Divine right in the medieval world asserted that a ruler's authority derived from God and was confirmed through ritual and law. In France, Capetian kings received holy unction at Reims, grounding sacral monarchy. Byzantine emperors styled themselves God's vicegerents and presided over an Orthodox court ceremonial. Caliphal legitimacy joined religious leadership with temporal rule in Islamic polities. Coronation oaths and liturgy framed obedience as a moral duty, while resistance risked sacrilege. Contests over investiture and deposition exposed limits, yet the doctrine shaped diplomacy, jurisprudence, and the language of sovereignty well beyond the Middle Ages.",
    "image": "/media/images/technologyType/divineRight.jpg",
    "key": "technologyType:divineRight",
    "name": "Divine Right",
    "quote": {
      "text": "I am the state.",
      "source": "Louis XIV of France, 1655",
      "url": "/media/quotes/technologyType/divineRight.mp3"
    },
    "requires": ["technologyType:castles", "technologyType:chivalry"],
    "x": 8,
    "y": 49,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 200
      }
    ]
  },
  {
    "category": "eraType:renaissance",
    "concept": "conceptType:technology",
    "description": "Trade caravans organized merchants, guards, pack animals, and guides into protected convoys across long overland routes. Caravans managed risk, coordinated provisioning, and synchronized travel to seasonal weather. On the Silk Road they moved silk, paper, and ceramics between China, Central Asia, and the Mediterranean. Trans-Saharan caravans hauled gold, salt, and slaves between the Niger bend and Maghrib. Caravanserais spaced a day's march apart offered lodging, fodder, and storage. Under Mongol rule, relay posts and passports eased passage for sanctioned traders. The system linked markets and states before maritime carriage displaced many routes.",
    "image": "/media/images/technologyType/tradeCaravans.jpg",
    "key": "technologyType:tradeCaravans",
    "name": "Trade Caravans",
    "quote": {
      "text": "Without trade, the empire falls.",
      "source": "Arabic proverb, ca. 1200",
      "url": "/media/quotes/technologyType/tradeCaravans.mp3"
    },
    "requires": ["technologyType:steelSmithing", "technologyType:clinkerHulls"],
    "x": 2,
    "y": 51,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 218
      }
    ]
  },
  {
    "category": "eraType:renaissance",
    "concept": "conceptType:technology",
    "description": "Medieval optics advanced theories of vision and practical lens craft. Ibn al-Haytham's Book of Optics (c. 1021) argued that sight results from light entering the eye, not rays emitted by it. He analyzed reflection, refraction, and the camera obscura through experiment and geometry. Translations into Latin circulated in Europe by the thirteenth century. Italian artisans developed glass grinding for convex lenses, leading to eyeglasses for presbyopia by the 1280s. Scholastics and natural philosophers, including Robert Grosseteste and Roger Bacon, applied optical principles to astronomy and surveying. Artists and engineers exploited camera obscura effects to study perspective and projection. By 1400, lens quality and theory enabled more accurate instruments and laid groundwork for telescopes and scientific optics in the early modern period.",
    "image": "/media/images/technologyType/optics.jpg",
    "key": "technologyType:optics",
    "name": "Optics",
    "quote": {
      "text": "The eye is the noblest of the senses.",
      "source": "Ibn al-Haytham, 1020",
      "url": "/media/quotes/technologyType/optics.mp3"
    },
    "requires": ["technologyType:steelSmithing", "technologyType:divineRight"],
    "x": 6,
    "y": 51,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 218
      }
    ]
  },
  {
    "category": "eraType:renaissance",
    "concept": "conceptType:technology",
    "description": "The magnetic compass provided a steady directional reference independent of sky or coast. Chinese navigators used a magnetized needle in a bowl of water by the Song era, later developing dry-card compasses. Knowledge moved along Asian trade networks to the Indian Ocean and Mediterranean in the thirteenth century. European mariners paired the compass with portolan charts and the sternpost rudder to extend open-sea passages. The nautical box compass, often gimballed, stabilized the card on rolling decks. Mariners learned to allow for variation and deviation, though magnetic declination limited precision. The instrument enabled winter sailing, fog navigation, and longer transits between fixed landfalls, reshaping pilotage and route planning.",
    "image": "/media/images/technologyType/compass.jpg",
    "key": "technologyType:compass",
    "name": "Compass",
    "quote": {
      "text": "When the stars are hidden, the needle still guides.",
      "source": "Arab mariner proverb, ca. 1300",
      "url": "/media/quotes/technologyType/compass.mp3"
    },
    "requires": ["technologyType:tradeCaravans", "technologyType:optics"],
    "x": 4,
    "y": 53,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 236
      }
    ]
  },
  {
    "category": "eraType:renaissance",
    "concept": "conceptType:technology",
    "description": "A buttress is a masonry projection built to counter lateral thrust from roofs and vaults. Medieval builders refined the form to support soaring stone churches. The flying buttress moved the line of thrust from the nave vault to an external pier through an arched flyer. This allowed thinner walls and large stained-glass windows. Early experiments appear in Romanesque works, but full systems matured in 12th–13th century Île-de-France. Engineers added pinnacles to increase compressive load and resist wind. Channels and weatherings shed water from joints. Notable achievements include the networks at Notre-Dame de Paris and Chartres Cathedral. Similar devices strengthened Reims and Canterbury. Buttressing also reinforced castle curtain walls and towers. The principle persisted into later revival styles and informed modern analysis of load paths.",
    "image": "/media/images/technologyType/buttress.jpg",
    "key": "technologyType:buttress",
    "name": "Buttress",
    "quote": {
      "text": "Beauty rises from strength unseen.",
      "source": "Gothic architectural maxim, ca. 1250",
      "url": "/media/quotes/technologyType/buttress.mp3"
    },
    "requires": ["technologyType:optics"],
    "x": 8,
    "y": 53,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 236
      }
    ]
  },
  {
    "category": "eraType:exploration",
    "concept": "conceptType:technology",
    "description": "A carvel hull uses edge-to-edge planking fastened to a robust frame, producing a smooth exterior. Mediterranean shipwrights developed the technique, which Portuguese builders adapted for oceanic caravels and larger carracks. The smooth skin reduced drag and accepted deeper, broader hulls with greater cargo capacity. Frame-first construction eased standardization and repair. Caulking with oakum and pitch sealed seams. Ships built this way mounted heavier masts and, later, artillery. Carvel-built vessels carried Bartolomeu Dias around the Cape of Good Hope and Vasco da Gama to India. Christopher Columbus sailed carvel-rigged Niña and Pinta alongside the larger carrack Santa María. The method underpinned the transition to galleons and line-of-battle ships, anchoring Europe’s long-range navigation and trade.",
    "image": "/media/images/technologyType/carvelHulls.jpg",
    "key": "technologyType:carvelHulls",
    "name": "Carvel Hulls",
    "quote": {
      "text": "A well-joined plank carries a man to the ends of the earth.",
      "source": "Portuguese proverb, ca. 1500",
      "url": "/media/quotes/technologyType/carvelHulls.mp3"
    },
    "requires": ["technologyType:compass"],
    "x": 2,
    "y": 56,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 240
      }
    ]
  },
  {
    "category": "eraType:exploration",
    "concept": "conceptType:technology",
    "description": "Gunpowder is a low explosive mixture of saltpeter, charcoal, and sulfur. It originated in China by the ninth century and moved west through the Islamic world and Mongol-era contacts. By the Renaissance, corned powder and better refining increased power and reliability. Artillery reshaped siege warfare and fortification design, leading to the trace italienne. The Ottoman bombardment of Constantinople in 1453 displayed large-bore guns’ potential. European armies fielded arquebuses and muskets with matchlocks, then wheel and flint mechanisms. Ming and later Qing forces maintained casting and deployment of cannon along frontiers and coasts. Black powder also enabled mining and civil engineering blasting. Standardized recipes, granulation, and controlled milling improved consistency and transport safety. Despite later substitutes, traditional compositions remained common into the nineteenth century.",
    "image": "/media/images/technologyType/gunpowder.jpg",
    "key": "technologyType:gunpowder",
    "name": "Gunpowder",
    "quote": {
      "text": "The wall fears the cannon.",
      "source": "Ottoman proverb, ca. 1500",
      "url": "/media/quotes/technologyType/gunpowder.mp3"
    },
    "requires": ["technologyType:compass", "technologyType:buttress"],
    "x": 6,
    "y": 56,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 240
      }
    ]
  },
  {
    "category": "eraType:exploration",
    "concept": "conceptType:technology",
    "description": "Fundamentalism in early modern Europe described strict adherence to religious doctrine that directed public and private life. Reformers and magistrates sought uniform belief as a foundation for order. Geneva under John Calvin enforced discipline through consistory courts. The English and Scottish Reformations produced zealous movements that shaped policy and warfare. Puritan leaders built governance in Massachusetts Bay around covenant theology. Catholic monarchies sponsored the Counter-Reformation, using councils, missions, and inquisitorial courts to police doctrine. These regimes legislated worship, education, and morals. Confessional rigidity influenced diplomacy and civil conflict from the French Wars of Religion to the Thirty Years’ War.",
    "image": "/media/images/technologyType/fundamentalism.jpg",
    "key": "technologyType:fundamentalism",
    "name": "Fundamentalism",
    "quote": {
      "text": "One faith, one law, one king.",
      "source": "French religious motto, ca. 1550",
      "url": "/media/quotes/technologyType/fundamentalism.mp3"
    },
    "requires": ["technologyType:buttress"],
    "x": 10,
    "y": 56,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 240
      }
    ]
  },
  {
    "category": "eraType:exploration",
    "concept": "conceptType:technology",
    "description": "Military discipline in the Renaissance and early modern era created coherent units through drill, hierarchy, and standardized tactics. Humanist studies of Roman practice inspired manuals on formations and camp order. Maurice of Nassau introduced regular drill, countermarch firing, and modular companies. Gustavus Adolphus refined linear tactics, lighter artillery, and coordinated arms. The Spanish tercio combined pikes and shot before yielding to thinner lines. Standing armies emerged with pay, musters, and logistics systems. Officers enforced cadence, synchronized volleys, and bayonet or pike charges. Drill books and inspections spread common procedures across states. These reforms increased battlefield control and sustained long campaigns.",
    "image": "/media/images/technologyType/militaryDiscipline.jpg",
    "key": "technologyType:militaryDiscipline",
    "name": "Military Discipline",
    "quote": {
      "text": "Drill makes many men one.",
      "source": "Swedish army manual, ca. 1600",
      "url": "/media/quotes/technologyType/militaryDiscipline.mp3"
    },
    "requires": ["technologyType:carvelHulls", "technologyType:gunpowder"],
    "x": 4,
    "y": 58,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 260
      }
    ]
  },
  {
    "category": "eraType:exploration",
    "concept": "conceptType:technology",
    "description": "Civil service expanded as European states professionalized administration. Rulers built salaried bureaucracies that collected revenue, kept records, and enforced law. France developed intendants who supervised provinces and bypassed local estates. Habsburg lands assembled chanceries and cameral offices staffed by trained jurists. The Ottoman Empire maintained scribal institutions and undertook administrative reforms alongside timar changes. Merit claims grew with examinations, legal education, and career ladders, though patronage persisted. Central archives and correspondence networks tied capitals to frontier districts. The Spanish Monarchy coordinated its composite realms through councils and audiencias. These systems stabilized governance and supported taxation, war finance, and imperial management.",
    "image": "/media/images/technologyType/civilService.jpg",
    "key": "technologyType:civilService",
    "name": "Civil Service",
    "quote": {
      "text": "The palest ink is better than the strongest memory.",
      "source": "Chinese proverb, ca. 1000",
      "url": "/media/quotes/technologyType/civilService.mp3"
    },
    "requires": ["technologyType:gunpowder", "technologyType:fundamentalism"],
    "x": 8,
    "y": 58,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 260
      }
    ]
  },
  {
    "category": "eraType:exploration",
    "concept": "conceptType:technology",
    "description": "A township in the early modern sense was an organized municipal community with legal personality, defined boundaries, and local institutions. Town charters in England and the Low Countries granted markets, courts, and self-taxation. Dutch municipalities maintained guild oversight and water management boards. Colonial planners exported ordered layouts across the Atlantic. New England settlers surveyed townships in grids with common lands and meetinghouses. Iberian America used the Laws of the Indies to prescribe plazas, streets, and cabildos. Townships handled policing, poor relief, militia musters, and infrastructure. Their councils linked rural hinterlands to regional trade and to central authorities.",
    "image": "/media/images/technologyType/township.jpg",
    "key": "technologyType:township",
    "name": "Township",
    "quote": {
      "text": "Town air makes you free.",
      "source": "German proverb, ca. 1300",
      "url": "/media/quotes/technologyType/township.mp3"
    },
    "requires": ["technologyType:militaryDiscipline", "technologyType:civilService"],
    "x": 6,
    "y": 60,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 280
      }
    ]
  },
  {
    "category": "eraType:exploration",
    "concept": "conceptType:technology",
    "description": "A theater is a purpose-built venue for public performance. Renaissance Europe revived classical forms and added new stagecraft. Italian architects created indoor theaters with fixed scenery and perspective stages, as at the Teatro Olimpico in Vicenza (1585) and the Teatro Farnese in Parma (1618). Public amphitheaters in England housed commercial drama; the Globe in London presented Shakespeare’s plays to mixed audiences. Municipal patronage and royal companies institutionalized performance. In France, the Comédie-Française became a permanent troupe with a dedicated house. Theaters incorporated galleries, pit floors, and backstage machinery for swift scene changes. They served civic ceremony, court spectacle, and emerging professional companies, shaping urban culture.",
    "image": "/media/images/technologyType/theater.jpg",
    "key": "technologyType:theater",
    "name": "Theater",
    "quote": {
      "text": "All the world's a stage.",
      "source": "William Shakespeare, 1599",
      "url": "/media/quotes/technologyType/theater.mp3"
    },
    "requires": ["technologyType:civilService"],
    "x": 10,
    "y": 60,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 280
      }
    ]
  },
  {
    "category": "eraType:colonial",
    "concept": "conceptType:technology",
    "description": "Cold steel denotes edged weapons and bayonet fighting used to deliver shock at close range. The socket bayonet allowed muskets to function as spears without removing the barrel from action, displacing the pike. Infantry doctrine in the eighteenth century combined controlled volleys with rapid advance and a decisive charge. Swedish forces in the Great Northern War practiced aggressive assaults at close order. Russian commanders, including Suvorov, stressed the bayonet as the final arbiter. During the Seven Years’ War, European armies executed column or line attacks aimed at breaking cohesion. Training emphasized steadiness, timing, and morale. Though firepower grew, cold steel remained integral for storming works and settling encounters after ammunition expenditure.",
    "image": "/media/images/technologyType/coldSteel.jpg",
    "key": "technologyType:coldSteel",
    "name": "Cold Steel",
    "quote": {
      "text": "The sword speaks when words fail.",
      "source": "Spanish fencing manual, 1620",
      "url": "/media/quotes/technologyType/coldSteel.mp3"
    },
    "requires": ["technologyType:township"],
    "x": 0,
    "y": 63,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 290
      }
    ]
  },
  {
    "category": "eraType:colonial",
    "concept": "conceptType:technology",
    "description": "Colonialism in the Enlightenment era involved overseas conquest, settlement, and resource extraction by European states. Maritime empires relied on chartered companies, fortified ports, and naval protection. Spain governed vast American territories through viceroyalties, mines, and missions. The Dutch consolidated the East Indies under the VOC with spice monopolies and coercive trade. Britain expanded colonies in North America and the Caribbean, pairing plantations with the Atlantic slave trade. Legal regimes reorganized land and labor, while surveys and maps asserted claims. Colonial cities such as Mexico City, Batavia, and Boston anchored administration and commerce. These systems reshaped global flows of silver, spices, and agricultural staples.",
    "image": "/media/images/technologyType/colonialism.jpg",
    "key": "technologyType:colonialism",
    "name": "Colonialism",
    "quote": {
      "text": "First comes the trader, then the soldier.",
      "source": "Dutch proverb, ca. 1600",
      "url": "/media/quotes/technologyType/colonialism.mp3"
    },
    "requires": ["technologyType:township"],
    "x": 4,
    "y": 63,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 290
      }
    ]
  },
  {
    "category": "eraType:colonial",
    "concept": "conceptType:technology",
    "description": "Firearms in the Enlightenment era became standardized tools of state warfare. Armies shifted from mixed pikes and guns to line infantry armed with flintlock muskets and socket bayonets. Drill enabled coordinated volley fire and platoon firing. Caliber patterns and paper cartridges eased supply. Cavalry adopted carbines and pistols for close action. Navies mounted uniform batteries of long guns and carronades for broadside fire. Manufacture remained craft based but concentrated in state armories with gauges and inspection. Tactical doctrine favored range discipline, smoke control, and combined artillery support. Firearms shaped imperial campaigns, siege reduction, and colonial encounters. By the late eighteenth century, massed musketry defined battlefield lethality, while experimental rifles foreshadowed future accuracy.",
    "image": "/media/images/technologyType/firearms.jpg",
    "key": "technologyType:firearms",
    "name": "Firearms",
    "quote": {
      "text": "The quickest shot lives longest.",
      "source": "French military manual, 1703",
      "url": "/media/quotes/technologyType/firearms.mp3"
    },
    "requires": ["technologyType:township", "technologyType:theater"],
    "x": 8,
    "y": 63,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 290
      }
    ]
  },
  {
    "category": "eraType:colonial",
    "concept": "conceptType:technology",
    "description": "Cartography during the Enlightenment fused mathematics, astronomy, and state administration. Surveyors built national triangulation networks, such as the Cassini project in France, to fix geodetic baselines. Marine cartographers improved coastal charts through systematic sounding and lunar-distance or chronometer-based longitude. James Cook’s Pacific surveys set new standards for accuracy and toponymy. Cadastral mapping supported taxation, conscription, and land reform. Standardized symbols and projections circulated through atlases and naval manuals. Governments and learned societies financed expeditions to close gaps from polar regions to colonial interiors.",
    "image": "/media/images/technologyType/cartography.jpg",
    "key": "technologyType:cartography",
    "name": "Cartography",
    "quote": {
      "text": "No man’s land is land unmarked.",
      "source": "Spanish exploration report, 1606",
      "url": "/media/quotes/technologyType/cartography.mp3"
    },
    "requires": ["technologyType:coldSteel", "technologyType:colonialism"],
    "x": 2,
    "y": 65,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 312
      }
    ]
  },
  {
    "category": "eraType:colonial",
    "concept": "conceptType:technology",
    "description": "Pistols evolved into reliable one-handed firearms for cavalry, officers, and civilians. Early wheellocks gave way to simpler flintlocks with martial holster pairs for shock action at the gallop. Effective range was short, favoring close discharge and saber follow-through. Naval officers carried pistols for boarding actions. Civilian use included travel defense and regulated dueling, which produced matched smoothbore sets with hair triggers and consistent bore. Makers in London, Liège, and Suhl refined locks, barrels, and sights. Safety practices, rammer storage, and belt or sash carriage became standardized. By the late eighteenth century, pistols were an established sidearm class, preceding the percussion-cap and revolver innovations of the nineteenth century.",
    "image": "/media/images/technologyType/pistols.jpg",
    "key": "technologyType:pistols",
    "name": "Pistols",
    "quote": {
      "text": "The pistol decides what the sword disputes.",
      "source": "English officer’s manual, 1759",
      "url": "/media/quotes/technologyType/pistols.mp3"
    },
    "requires": ["technologyType:colonialism", "technologyType:firearms"],
    "x": 6,
    "y": 65,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 312
      }
    ]
  },
  {
    "category": "eraType:colonial",
    "concept": "conceptType:technology",
    "description": "Enlightenment architecture integrated Baroque display with rational planning and improved construction science. Urban rebuilding after disasters, as in Wren’s London churches, applied survey control and fireproofing. Court and civic patrons commissioned palaces and theatres with advanced acoustics and circulation. Engineers adapted fortification geometry under Vauban’s influence, refining bastions and glacis. Pattern books and academies spread proportional canons and structural calculation. Late in the period, Neoclassicism drew on antiquity, favoring clear volumes and ordered facades tied to new materials and standardized components.",
    "image": "/media/images/technologyType/architecture.jpg",
    "key": "technologyType:architecture",
    "name": "Architecture",
    "quote": {
      "text": "The mason’s hand endures in the stone.",
      "source": "Italian Baroque builder’s maxim, ca. 1600",
      "url": "/media/quotes/technologyType/architecture.mp3"
    },
    "requires": ["technologyType:firearms"],
    "x": 10,
    "y": 65,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 312
      }
    ]
  },
  {
    "category": "eraType:colonial",
    "concept": "conceptType:technology",
    "description": "Education expanded through reformed universities, academies, and emerging public schools. Curricula added mathematics, natural philosophy, modern languages, and practical surveying. Laboratories and museums supported empirical teaching. States founded teacher seminaries and regulated examinations for professions such as medicine, law, and engineering. Learned societies linked research with instruction through lectures and prize questions. Literacy rates rose in urban centers, aided by cheap print and subscription libraries. Confessional systems persisted, yet secular administration shaped funding, inspection, and textbook production across Europe and colonial settings.",
    "image": "/media/images/technologyType/education.jpg",
    "key": "technologyType:education",
    "name": "Education",
    "quote": {
      "text": "The pen is mightier than the sword.",
      "source": "Edward Bulwer-Lytton, 1839",
      "url": "/media/quotes/technologyType/education.mp3"
    },
    "requires": ["technologyType:cartography"],
    "x": 2,
    "y": 67,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 334
      }
    ]
  },
  {
    "category": "eraType:colonial",
    "concept": "conceptType:technology",
    "description": "Banking in the Enlightenment organized capital for commerce and war finance. The Amsterdam Wisselbank stabilized clearing through giro deposits and bullion custody. The Bank of England combined note issue with funded national debt, enabling long-term borrowing at scale. Merchant banks extended bills of exchange and acceptance credit across Atlantic and Asian trades. Stock exchanges and joint-stock ventures broadened investment. States used annuities and lotteries to service obligations. Crises spurred regulation, auditing, and reserve practices that framed later central banking.",
    "image": "/media/images/technologyType/banking.jpg",
    "key": "technologyType:banking",
    "name": "Banking",
    "quote": {
      "text": "The banker’s power is felt, not seen.",
      "source": "Dutch finance proverb, ca. 1600",
      "url": "/media/quotes/technologyType/banking.mp3"
    },
    "requires": ["technologyType:pistols", "technologyType:architecture"],
    "x": 8,
    "y": 67,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 334
      }
    ]
  },
  {
    "category": "eraType:enlightenment",
    "concept": "conceptType:technology",
    "description": "Mercantilism guided economic policy toward trade surpluses and bullion accumulation. Governments protected domestic manufactures with tariffs and bounties. Navigation laws reserved colonial carriage to national ships and channeled commerce through metropolitan ports. Colbert’s France harmonized taxes and standards to favor export industries. Chartered companies held monopolies in Asia, Africa, and the Americas, integrating forts, plantations, and fleets. Critics emerged late in the century, yet the system structured imperial competition and fiscal-military states.",
    "image": "/media/images/technologyType/mercantilism.jpg",
    "key": "technologyType:mercantilism",
    "name": "Mercantilism",
    "quote": {
      "text": "Let gold flow in, but never out.",
      "source": "French mercantile policy, ca. 1650",
      "url": "/media/quotes/technologyType/mercantilism.mp3"
    },
    "requires": ["technologyType:education", "technologyType:banking"],
    "x": 4,
    "y": 70,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 340
      }
    ]
  },
  {
    "category": "eraType:enlightenment",
    "concept": "conceptType:technology",
    "description": "The flintlock was an ignition system that struck flint against steel to spark priming powder and fire the main charge. It replaced matchlocks and wheellocks through superior reliability, weather resistance, and simplicity. Standardized military patterns appeared, such as French models from 1717 and British Brown Bess muskets, along with Charleville arms. The lock combined cock, frizzen, pan, and spring geometry tuned for fast ignition. Widespread use from the late seventeenth to early nineteenth centuries shaped infantry drill and cavalry sidearms. Percussion caps later displaced flintlocks, but the mechanism defined the classic musket era.",
    "image": "/media/images/technologyType/flintlock.jpg",
    "key": "technologyType:flintlock",
    "name": "Flintlock",
    "quote": {
      "text": "First the flash, then the roar.",
      "source": "British infantry proverb, ca. 1750",
      "url": "/media/quotes/technologyType/flintlock.mp3"
    },
    "requires": ["technologyType:banking"],
    "x": 10,
    "y": 70,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 340
      }
    ]
  },
  {
    "category": "eraType:enlightenment",
    "concept": "conceptType:technology",
    "description": "Enlightenment diplomacy developed permanent embassies, coded correspondence, and multilateral congresses. The Peace of Westphalia supplied a legal baseline for sovereignty and nonintervention. The Treaty of Utrecht rebalanced dynastic claims and trade. Resident ambassadors reported intelligence and negotiated alliances within a balance-of-power framework. Protocol, extraterritoriality, and precedence were formalized. Specialized foreign offices managed archives and treaty law. Congresses coordinated settlements after major wars and shaped boundaries across Europe and overseas.",
    "image": "/media/images/technologyType/diplomacy.jpg",
    "key": "technologyType:diplomacy",
    "name": "Diplomacy",
    "quote": {
      "text": "An ambassador is an honest man sent to lie abroad.",
      "source": "Sir Henry Wotton, 1604",
      "url": "/media/quotes/technologyType/diplomacy.mp3"
    },
    "requires": ["technologyType:mercantilism"],
    "x": 2,
    "y": 72,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 364
      }
    ]
  },
  {
    "category": "eraType:enlightenment",
    "concept": "conceptType:technology",
    "description": "Opera in the Enlightenment joined orchestral writing, vocal virtuosity, and stage machinery. Courts and public theaters in Vienna, Naples, and London supported opera seria and opera buffa. Handel developed English-language works and Italian-style dramas for London audiences. Mozart integrated ensemble writing and character depth within clear forms. Castrati, prima donnas, and star impresarios drove repertory and touring circuits. Printed libretti and published scores spread styles across Europe and colonial venues.",
    "image": "/media/images/technologyType/opera.jpg",
    "key": "technologyType:opera",
    "name": "Opera",
    "quote": {
      "text": "The theatre is the true mirror of life.",
      "source": "Molière, ca. 1670",
      "url": "/media/quotes/technologyType/opera.mp3"
    },
    "requires": ["technologyType:mercantilism"],
    "x": 6,
    "y": 72,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 364
      }
    ]
  },
  {
    "category": "eraType:enlightenment",
    "concept": "conceptType:technology",
    "description": "Steel casting denotes producing complex shapes by pouring molten steel into molds. Early modern metallurgy struggled with steel’s high melting point and shrinkage. In the 1740s Benjamin Huntsman in Sheffield developed crucible steel, yielding homogeneous ingots that enabled small castings and superior tool steels. Clock springs, edge tools, and precision parts used cast steel stock. Efforts to cast large pieces, including cannon, faced cracking and porosity. Nineteenth-century processes transformed the field. Bessemer converters and Siemens–Martin open-hearth furnaces provided bulk steel with controlled chemistry, while risers and feeders improved soundness. Firms such as Krupp produced large cast steel gun barrels, tires, and crankshafts. Steel castings entered railway couplers, pump bodies, and machine frames where strength and toughness were required. By the late nineteenth century foundry practice standardized molding sands, gating, and heat treatment, making steel casting a core industrial capability.",
    "image": "/media/images/technologyType/steelCasting.jpg",
    "key": "technologyType:steelCasting",
    "name": "Steel Casting",
    "quote": {
      "text": "Cast where strength is wanted.",
      "source": "Foundry motto, ca. 1850",
      "url": "/media/quotes/technologyType/steelCasting.mp3"
    },
    "requires": ["technologyType:flintlock"],
    "x": 10,
    "y": 72,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 364
      }
    ]
  },
  {
    "category": "eraType:enlightenment",
    "concept": "conceptType:technology",
    "description": "The scientific method is a procedural approach to knowledge based on observation, experiment, and reasoned inference. Early modern advocates proposed structured inquiry that could test claims against nature. Francis Bacon argued for inductive methods in Novum Organum, urging systematic collection of facts. Galileo combined experiment with mathematical analysis to study motion and astronomy. Isaac Newton synthesized mechanics and celestial phenomena in the Principia, demonstrating the power of theory grounded in evidence. During the Enlightenment, academies and journals spread replicable techniques, priority claims, and peer critique. The method became the normative standard for physics, chemistry, and later the life sciences.",
    "image": "/media/images/technologyType/scientificMethod.jpg",
    "key": "technologyType:scientificMethod",
    "name": "Scientific Method",
    "quote": {
      "text": "Nullius in verba: Take no one's word for it.",
      "source": "Royal Society motto, 1660",
      "url": "/media/quotes/technologyType/scientificMethod.mp3"
    },
    "requires": ["technologyType:diplomacy"],
    "x": 0,
    "y": 74,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 388
      }
    ]
  },
  {
    "category": "eraType:enlightenment",
    "concept": "conceptType:technology",
    "description": "Nationalism is a political ideology that locates sovereignty in a people defined by common language, culture, or history. In eighteenth‑century Europe it emerged alongside print culture, mass mobilization, and state centralization. The French Revolution linked citizenship to military service through the levée en masse. Thinkers such as Johann Gottfried Herder promoted German cultural unity. Italian patriots carried early Risorgimento sentiment into the nineteenth century. Nationalism shaped constitutional movements, independence struggles, and the reorganization of empires. It provided a framework for popular allegiance to the nation‑state, often superseding local or dynastic loyalties.",
    "image": "/media/images/technologyType/nationalism.jpg",
    "key": "technologyType:nationalism",
    "name": "Nationalism",
    "quote": {
      "text": "One nation, indivisible, with liberty and justice for all.",
      "source": "Francis Bellamy, 1892",
      "url": "/media/quotes/technologyType/nationalism.mp3"
    },
    "requires": ["technologyType:diplomacy", "technologyType:opera"],
    "x": 4,
    "y": 74,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 388
      }
    ]
  },
  {
    "category": "eraType:enlightenment",
    "concept": "conceptType:technology",
    "description": "Art history arose in the Enlightenment as a systematic study of artworks, styles, and patrons across time. Johann Joachim Winckelmann’s History of Ancient Art (1764) proposed chronological development and valued classical antiquity, guiding neoclassical taste. Royal academies formalized training, connoisseurship, and critique. Museums and cabinets expanded into public collections with cataloging practices that documented provenance and technique. Travel, archaeology, and antiquarian inquiry widened the corpus to include ancient Mediterranean, medieval, and non‑European material. By the nineteenth century, art history employed comparative analysis, periodization, and stylistic schools to interpret production and reception within cultural contexts.",
    "image": "/media/images/technologyType/artHistory.jpg",
    "key": "technologyType:artHistory",
    "name": "Art History",
    "quote": {
      "text": "Every age has its own art.",
      "source": "French salon critic, ca. 1750",
      "url": "/media/quotes/technologyType/artHistory.mp3"
    },
    "requires": ["technologyType:opera", "technologyType:steelCasting"],
    "x": 8,
    "y": 74,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 388
      }
    ]
  },
  {
    "category": "eraType:enlightenment",
    "concept": "conceptType:technology",
    "description": "A royal charter is a legal instrument issued by a monarch to create corporations, grant privileges, or define jurisdictions. In the early modern and Enlightenment periods it structured commerce and colonization. The British East India Company and the Hudson’s Bay Company operated under chartered monopolies and governance rights. Charters established cities, universities, and professional bodies, fixing duties and internal rules. Parliamentary oversight and later company law curtailed exclusive grants in the nineteenth century, but chartered status persisted for learned societies and established institutions. The device anchored early corporate law and imperial administration through defined privileges and accountability.",
    "image": "/media/images/technologyType/royalCharter.jpg",
    "key": "technologyType:royalCharter",
    "name": "Royal Charter",
    "quote": {
      "text": "The king’s word is law.",
      "source": "English royal maxim, ca. 1600",
      "url": "/media/quotes/technologyType/royalCharter.mp3"
    },
    "requires": ["technologyType:steelCasting"],
    "x": 12,
    "y": 74,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 388
      }
    ]
  },
  {
    "category": "eraType:industrial",
    "concept": "conceptType:technology",
    "description": "Industrialization is the shift from artisanal production to mechanized, factory‑based systems powered by new energy sources. It began in eighteenth‑century Britain with textile spinning and weaving, fueled by coal and improved ironmaking. Watt engines drove machinery; canals and later railways integrated markets. The model spread to Europe and North America, where the Lowell system combined water and steam power with regimented labor. Urbanization, time discipline, and wage labor reshaped social structures. Industrialization diversified into chemicals, steel, and machine tools in the nineteenth century, creating sustained productivity growth and global trade networks that reoriented states and empires.",
    "image": "/media/images/technologyType/industrialization.jpg",
    "key": "technologyType:industrialization",
    "name": "Industrialization",
    "quote": {
      "text": "The machine never sleeps.",
      "source": "American mill slogan, ca. 1880",
      "url": "/media/quotes/technologyType/industrialization.mp3"
    },
    "requires": ["technologyType:scientificMethod", "technologyType:nationalism"],
    "x": 2,
    "y": 77,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 390
      }
    ]
  },
  {
    "category": "eraType:industrial",
    "concept": "conceptType:technology",
    "description": "Military tradition in the industrial era denotes professional doctrine, institutional memory, and standardized training that guide armed forces. The Prussian General Staff developed operational planning, war games, and systematic study of campaigns. West Point and comparable academies formalized engineering, artillery science, and leadership curricula. Mass conscription linked society to mobilization through reserve and territorial systems. Drill regulations, logistics services, and staff manuals codified procedures across branches. Railways and telegraphs were integrated into mobilization plans. This tradition supported large national armies capable of coordinated operations, sustained firepower, and rapid reinforcement in European and transoceanic conflicts.",
    "image": "/media/images/technologyType/militaryTradition.jpg",
    "key": "technologyType:militaryTradition",
    "name": "Military Tradition",
    "quote": {
      "text": "A regiment remembers.",
      "source": "British army maxim, ca. 1800",
      "url": "/media/quotes/technologyType/militaryTradition.mp3"
    },
    "requires": ["technologyType:nationalism", "technologyType:artHistory"],
    "x": 6,
    "y": 77,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 390
      }
    ]
  },
  {
    "category": "eraType:industrial",
    "concept": "conceptType:technology",
    "description": "Dynamite, patented by Alfred Nobel in 1867, stabilized liquid nitroglycerin by absorbing it into diatomaceous earth. The cartridge form allowed safer transport, cutting the risk of accidental detonation from shock. Nobel also improved blasting caps and fuses, enabling reliable initiation. Civil engineering adopted dynamite for tunnels, railway cuts, canals, and harbor works, notably in Alpine projects and North American rail construction. Mining expanded deeper and faster as controlled blasts broke rock efficiently. States instituted licensing, magazines, and safety rules to regulate storage and use. Although militaries used dynamite for demolition and torpedoes, cast explosives like picric acid and later TNT became preferred for shells. Nobel’s earnings funded scientific and cultural prizes.",
    "image": "/media/images/technologyType/dynamite.jpg",
    "key": "technologyType:dynamite",
    "name": "Dynamite",
    "quote": {
      "text": "Perhaps my dynamite will end war sooner than your congresses.",
      "source": "Alfred Nobel, 1891",
      "url": "/media/quotes/technologyType/dynamite.mp3"
    },
    "requires": ["technologyType:artHistory", "technologyType:royalCharter"],
    "x": 10,
    "y": 77,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 390
      }
    ]
  },
  {
    "category": "eraType:industrial",
    "concept": "conceptType:technology",
    "description": "The steam engine converts heat from boiling water into mechanical work through expanding steam. Thomas Savery’s pump (1698) and Thomas Newcomen’s atmospheric engine (1712) first drained mines. James Watt’s separate condenser and rotary motion, marketed with Matthew Boulton from the 1770s, greatly improved efficiency and enabled factory power. Beam and later high‑pressure engines drove textile mills, flour mills, and ironworks, while mine pumps increased output of coal and metals. Marine engines powered steamships on rivers, then oceans, reshaping trade and naval logistics. Locomotives extended steam power to railways in the 1820s–1830s. In the twentieth century turbines and internal‑combustion motors displaced many reciprocating engines, but steam remained central in electric power generation.",
    "image": "/media/images/technologyType/steamEngine.jpg",
    "key": "technologyType:steamEngine",
    "name": "Steam Engine",
    "quote": {
      "text": "Water boiled is the giant’s breath.",
      "source": "British railway slogan, ca. 1830",
      "url": "/media/quotes/technologyType/steamEngine.mp3"
    },
    "requires": ["technologyType:industrialization"],
    "x": 0,
    "y": 79,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 416
      }
    ]
  },
  {
    "category": "eraType:industrial",
    "concept": "conceptType:technology",
    "description": "Bureaucracy denotes a rational administrative order built on hierarchical offices, written procedures, and specialized expertise. In the nineteenth century many states professionalized civil services, separating office from person and securing tenure. Prussia developed examination systems and rule‑bound ministries that other European governments emulated. The Meiji Restoration created centralized ministries and prefectures in Japan, blending Western models with local practice. Standardized forms, statistics, and budgets improved fiscal control. This framework enabled modern taxation, education, infrastructure, and conscription. Max Weber later analyzed bureaucracy as a core feature of modern authority, contrasting it with patrimonial and charismatic rule.",
    "image": "/media/images/technologyType/bureaucracy.jpg",
    "key": "technologyType:bureaucracy",
    "name": "Bureaucracy",
    "quote": {
      "text": "Bureaucracy expands to meet the needs of the expanding bureaucracy.",
      "source": "Oscar Wilde, ca. 1890",
      "url": "/media/quotes/technologyType/bureaucracy.mp3"
    },
    "requires": ["technologyType:industrialization", "technologyType:militaryTradition"],
    "x": 4,
    "y": 79,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 416
      }
    ]
  },
  {
    "category": "eraType:industrial",
    "concept": "conceptType:technology",
    "description": "Rifling consists of helical grooves cut or formed in a gun barrel to impart spin to a projectile. Spin stabilizes flight and tightens shot dispersion. Early experiments appeared in early modern Europe, but industrial mass production transformed adoption. The conical Minié ball allowed rapid loading and effective engagement at several hundred meters, reshaping tactics in the Crimean War and the American Civil War. Precision machine tools produced consistent twist rates and bore dimensions, enabling standardized ammunition. Breech-loading service rifles such as the Prussian Dreyse and French Chassepot exploited rifled barrels for higher rates of fire and accuracy. Rifling design evolved with metallurgy and propellants, from slow twists for soft lead bullets to faster twists for elongated jacketed projectiles. By the late nineteenth century, rifling was universal in military small arms and prevalent in artillery, defining modern ballistics.",
    "image": "/media/images/technologyType/rifling.jpg",
    "key": "technologyType:rifling",
    "name": "Rifling",
    "quote": {
      "text": "The rifle’s twist carries its truth.",
      "source": "Union army manual, ca. 1860",
      "url": "/media/quotes/technologyType/rifling.mp3"
    },
    "requires": ["technologyType:militaryTradition", "technologyType:dynamite"],
    "x": 8,
    "y": 79,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 416
      }
    ]
  },
  {
    "category": "eraType:industrial",
    "concept": "conceptType:technology",
    "description": "Steel milling denotes mechanized rolling, shaping, and finishing processes that turned bulk steel into rails, plates, and structural sections at industrial scale. Bessemer converters and Siemens–Martin open-hearth furnaces supplied large heats with controlled composition. Powered rolling mills reduced ingots through sequential stands to precise gauges, producing rails for expanding railways and standardized I-beams for multistory construction. Hot and cold finishing improved surface and dimensional tolerances. Mechanical handling, reheating furnaces, and shears integrated flow. The system lowered unit costs, extended product lengths, and improved consistency over wrought iron practice. By the late nineteenth century, steel mills underpinned heavy industry, shipbuilding, and urban architecture, while continuous improvements in alloying and heat treatment expanded performance for tools, armor plate, and machinery.",
    "image": "/media/images/technologyType/steelMilling.jpg",
    "key": "technologyType:steelMilling",
    "name": "Steel Milling",
    "quote": {
      "text": "Steel flows to the will of the rollers.",
      "source": "Steel mill saying, ca. 1880",
      "url": "/media/quotes/technologyType/steelMilling.mp3"
    },
    "requires": ["technologyType:steamEngine", "technologyType:bureaucracy"],
    "x": 2,
    "y": 81,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 442
      }
    ]
  },
  {
    "category": "eraType:industrial",
    "concept": "conceptType:technology",
    "description": "Industrial-era medicine shifted from humoral doctrines to laboratory-based science. Advances in microscopy and experimental method produced germ theory, led by Pasteur and Koch, which linked specific microbes to disease and introduced vaccination and bacteriological diagnostics. Surgical practice adopted ether and chloroform anesthesia, then Lister’s antisepsis, reducing mortality in operations and wounds. Hospitals reorganized as clinical institutions with nursing standards and record-keeping. Public health emerged as an applied medical field, tracking epidemics and guiding sanitation policy. Medical education professionalized through teaching hospitals and standardized curricula. These changes increased survival, made surgery routine, and set foundations for modern therapeutics and epidemiology.",
    "image": "/media/images/technologyType/medicine.jpg",
    "key": "technologyType:medicine",
    "name": "Medicine",
    "quote": {
      "text": "Wash hands, save lives.",
      "source": "Joseph Lister, ca. 1870",
      "url": "/media/quotes/technologyType/medicine.mp3"
    },
    "requires": ["technologyType:bureaucracy", "technologyType:rifling"],
    "x": 6,
    "y": 81,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 442
      }
    ]
  },
  {
    "category": "eraType:industrial",
    "concept": "conceptType:technology",
    "description": "Sanitation developed as an urban public health system addressing water supply, sewage, and waste removal. Recurrent cholera and typhoid outbreaks spurred municipal engineering and regulation. London built a comprehensive interceptor sewer network under Joseph Bazalgette after the 1858 “Great Stink,” reducing waterborne disease. Boards of health enforced waste collection, privy replacement, and drainage standards. Filtration plants, piping, and separate storm and sanitary sewers followed in many cities. Statistical surveillance and outbreak mapping, popularized by John Snow’s work on cholera, guided interventions. By the late nineteenth century, sanitation infrastructure and ordinances became core functions of modern municipalities, improving mortality rates and enabling dense urban growth.",
    "image": "/media/images/technologyType/sanitation.jpg",
    "key": "technologyType:sanitation",
    "name": "Sanitation",
    "quote": {
      "text": "Sanitation is more important than independence.",
      "source": "Mahatma Gandhi, 1917",
      "url": "/media/quotes/technologyType/sanitation.mp3"
    },
    "requires": ["technologyType:rifling"],
    "x": 10,
    "y": 81,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 442
      }
    ]
  },
  {
    "category": "eraType:imperial",
    "concept": "conceptType:technology",
    "description": "Railroads combined steam locomotives, iron and later steel rails, and fixed way to move heavy loads at sustained speed. Early public service began with the Stockton and Darlington Railway in 1825, showing the viability of locomotive haulage. Network expansion followed in Britain and abroad, with trunk lines, bridges, and tunnels linking regions. Standardized track, couplers, and signaling improved safety and throughput. In 1869 the United States completed the First Transcontinental Railroad, integrating continental trade and migration. Companies such as the Great Western Railway built large workshops and timetables, introducing coordinated operations and timekeeping. Railroads lowered transport costs, reorganized markets, and shaped settlement and industrial location.",
    "image": "/media/images/technologyType/railroad.jpg",
    "key": "technologyType:railroad",
    "name": "Railroad",
    "quote": {
      "text": "It screamed like a living thing, and the earth shook beneath.",
      "source": "Eyewitness report, ca. 1840",
      "url": "/media/quotes/technologyType/railroad.mp3"
    },
    "requires": ["technologyType:steelMilling"],
    "x": 0,
    "y": 84,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 450
      }
    ]
  },
  {
    "category": "eraType:imperial",
    "concept": "conceptType:technology",
    "description": "Replaceable parts refers to manufacturing with standardized, interchangeable components fitted without hand filing. Early trials occurred in armories, where gauges, jigs, and templates produced uniform musket locks and barrels. In the nineteenth century, U.S. federal armories and contractors refined this “American System,” enabling repair in the field and faster assembly. The approach spread to sewing machines, clocks, and agricultural tools, as seen in Singer’s standardized subassemblies. Interchangeability required precise machine tools, measurement systems, and process control. It fostered specialized labor, distributed supply chains, and inventories of spares. By the late industrial era, interchangeable manufacture set the stage for flow production and later assembly-line systems in automobiles and appliances.",
    "image": "/media/images/technologyType/replaceableParts.jpg",
    "key": "technologyType:replaceableParts",
    "name": "Replaceable Parts",
    "quote": {
      "text": "Parts made alike fit alike.",
      "source": "Machinist’s proverb, ca. 1850",
      "url": "/media/quotes/technologyType/replaceableParts.mp3"
    },
    "requires": ["technologyType:steelMilling", "technologyType:medicine"],
    "x": 4,
    "y": 84,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 450
      }
    ]
  },
  {
    "category": "eraType:imperial",
    "concept": "conceptType:technology",
    "description": "Economics during the industrial age examined growth, distribution, and crises in mechanized markets. Classical political economy, developed by David Ricardo and others, analyzed comparative advantage and rent. Karl Marx’s Capital offered a historical critique of capitalist production and labor relations. The marginalist revolution of the 1870s, led by Jevons, Menger, and Walras, introduced marginal utility, general equilibrium, and mathematical methods. Empirical statistics, national income accounting precursors, and price series informed policy debates on tariffs, money, and labor. Economics professionalized through journals, societies, and university chairs, shaping legislation on trade, banking, poor relief, and antitrust.",
    "image": "/media/images/technologyType/economics.jpg",
    "key": "technologyType:economics",
    "name": "Economics",
    "quote": {
      "text": "Man is a being who desires to possess wealth.",
      "source": "John Stuart Mill, 1848",
      "url": "/media/quotes/technologyType/economics.mp3"
    },
    "requires": ["technologyType:medicine", "technologyType:sanitation"],
    "x": 8,
    "y": 84,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 450
      }
    ]
  },
  {
    "category": "eraType:imperial",
    "concept": "conceptType:technology",
    "description": "Electricity became a central industrial technology for power, light, and communication. Telegraph networks in the mid-nineteenth century carried signals across continents and under oceans. Practical generation began with dynamos and direct-current systems, exemplified by Edison’s Pearl Street Station and urban lighting grids. Alternating current, advanced by Nikola Tesla and commercialized by Westinghouse, enabled long-distance transmission and efficient motors. Transformers, switchgear, and distribution networks created utility-scale supply. Electric traction powered streetcars and later suburban rail. Factories adopted motors for flexible layouts beyond shaft-driven lines. Electrification reduced smoke in cities, extended working hours, and supported new industries from electrochemistry to telephone service.",
    "image": "/media/images/technologyType/electricity.jpg",
    "key": "technologyType:electricity",
    "name": "Electricity",
    "quote": {
      "text": "Prometheus now lights our wires, not our pyres.",
      "source": "The Times, 1882",
      "url": "/media/quotes/technologyType/electricity.mp3"
    },
    "requires": ["technologyType:sanitation"],
    "x": 12,
    "y": 84,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 450
      }
    ]
  },
  {
    "category": "eraType:imperial",
    "concept": "conceptType:technology",
    "description": "Industrial artillery shifted from cast bronze to steel, from muzzle-loading to breech-loading mechanisms, and from black powder to improved propellants. Precision machining and metallurgy allowed stronger barrels and tighter tolerances. Firms like Krupp supplied field and siege guns that dominated conflicts such as the Franco–Prussian War. Recoil systems at the century’s end, notably on the French 75 mm modèle 1897, permitted rapid aimed fire without re-laying. Indirect fire techniques, panoramic sights, and shrapnel and high-explosive shells expanded tactical roles. Rail and coastal artillery extended range and weight of shot. Artillery became the decisive arm for bombardment, counter-battery, and support.",
    "image": "/media/images/technologyType/artillery.jpg",
    "key": "technologyType:artillery",
    "name": "Artillery",
    "quote": {
      "text": "Gentlemen, you have before you the howitzer.",
      "source": "German officer, ca. 1864",
      "url": "/media/quotes/technologyType/artillery.mp3"
    },
    "requires": ["technologyType:railroad"],
    "x": 0,
    "y": 86,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 478
      }
    ]
  },
  {
    "category": "eraType:imperial",
    "concept": "conceptType:technology",
    "description": "Repeating rifles store multiple cartridges and cycle them to the chamber without separate loading of powder and ball. Mid-nineteenth-century designs used tubular magazines and lever actions, such as the Spencer repeaters fielded in the American Civil War and later Winchester models. These offered high practical rates of fire for cavalry and skirmishers. The bolt-action system with box magazines matured in the 1880s–1890s, culminating in Mauser patterns that combined strength, reliable feeding, and stripper-clip loading. Smokeless powder, small-bore jacketed bullets, and improved sights extended range and flattened trajectories. Repeating rifles altered tactics, logistics, and training by emphasizing ammunition supply, marksmanship, and fire discipline.",
    "image": "/media/images/technologyType/repeatingRifles.jpg",
    "key": "technologyType:repeatingRifles",
    "name": "Repeating Rifles",
    "quote": {
      "text": "This is my rifle. There are many like it, but this one is mine.",
      "source": "U.S. Marine Rifleman’s Creed, 1942",
      "url": "/media/quotes/technologyType/repeatingRifles.mp3"
    },
    "requires": ["technologyType:replaceableParts"],
    "x": 4,
    "y": 86,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 478
      }
    ]
  },
  {
    "category": "eraType:imperial",
    "concept": "conceptType:technology",
    "description": "Drilling in the industrial era combined improved power sources, tools, and geological method. Cable‑tool percussion rigs bored early oil and water wells, notably Edwin Drake’s 1859 well at Titusville, Pennsylvania. Rotary drilling, using circulating mud to cool bits and stabilize boreholes, accelerated deep wells and reduced collapses. Diamond‑core drills transformed mineral exploration by retrieving intact cores for assay in European mining districts. Urban water supply advanced through large artesian projects that tapped confined aquifers for growing cities. Steam and then internal‑combustion engines powered portable rigs, extending access to remote sites. Specialized techniques evolved for foundation piles, tunneling probe holes, and blast‑hole patterns in quarries. By the late nineteenth century, standardized casing, threaded pipe, and rudimentary blowout control set the groundwork for modern petroleum and geotechnical practice.",
    "image": "/media/images/technologyType/drilling.jpg",
    "key": "technologyType:drilling",
    "name": "Drilling",
    "quote": {
      "text": "The rock yields only to steel and steam.",
      "source": "Oil drilling proverb, ca. 1870",
      "url": "/media/quotes/technologyType/drilling.mp3"
    },
    "requires": ["technologyType:economics"],
    "x": 8,
    "y": 86,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 478
      }
    ]
  },
  {
    "category": "eraType:imperial",
    "concept": "conceptType:technology",
    "description": "Liberalism in the industrial age argued for civil liberties, equality before law, and competitive markets under constitutional government. Thinkers such as John Stuart Mill set out defenses of liberty of conscience, speech, and association in 1859. In Britain, repeal of the Corn Laws in 1846 advanced free trade doctrine, while Reform Acts broadened the electorate and curbed aristocratic control. Liberal parties promoted religious toleration, merit-based administration, and limits on executive power. Over time, some strands adapted to mass society by endorsing social insurance and education to secure effective freedom. The tradition shaped electoral reforms across Europe and the Atlantic world.",
    "image": "/media/images/technologyType/liberalism.jpg",
    "key": "technologyType:liberalism",
    "name": "Liberalism",
    "quote": {
      "text": "Equal rights to all, special privileges to none.",
      "source": "Grover Cleveland, 1887",
      "url": "/media/quotes/technologyType/liberalism.mp3"
    },
    "requires": ["technologyType:electricity"],
    "x": 12,
    "y": 86,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 478
      }
    ]
  },
  {
    "category": "eraType:imperial",
    "concept": "conceptType:technology",
    "description": "Trench warfare is a system of field fortification and positional combat marked by deep trenches, parapets, and barbed wire. It dominated the Western Front in World War I after mobile operations stalled in late 1914. Defensive firepower from machine guns and rapid artillery caused high casualties in assaults. Battles such as Verdun (1916) and the Somme involved prolonged bombardments, saps, mines, and creeping barrages. Chemical agents and improved mortars added to the attritional character. At Gallipoli (1915–1916), entrenchments constrained both sides on difficult terrain. Solutions later emphasized infiltration tactics, tanks, coordinated artillery, air reconnaissance, and flexible defense to restore mobility.",
    "image": "/media/images/technologyType/trenchWarfare.jpg",
    "key": "technologyType:trenchWarfare",
    "name": "Trench Warfare",
    "quote": {
      "text": "In Flanders fields the poppies blow / Between the crosses, row on row.",
      "source": "John McCrae, In Flanders Fields, 1915",
      "url": "/media/quotes/technologyType/trenchWarfare.mp3"
    },
    "requires": ["technologyType:artillery", "technologyType:repeatingRifles"],
    "x": 2,
    "y": 88,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 506
      }
    ]
  },
  {
    "category": "eraType:imperial",
    "concept": "conceptType:technology",
    "description": "Industrial-era chemistry became a laboratory science connected to large-scale production. Building on Lavoisier’s stoichiometry and conservation, nineteenth‑century chemists refined analytic methods, glassware, and instrumentation. Dmitri Mendeleev’s periodic table (1869) organized elements by atomic weight and predicted new ones, guiding research and pedagogy. Organic chemistry grew rapidly after coal‑tar distillation; William Henry Perkin’s aniline dyes sparked a German-led synthetic colorant industry centered at BASF, Bayer, and Hoechst. Industrial chemistry scaled key reagents such as sulfuric acid and alkalis through Leblanc and later Solvay processes, lowering costs for textiles, paper, and metallurgy. Electrochemistry enabled chlorine and aluminum production. Pharmaceutical synthesis, fertilizer development, and explosives chemistry linked university laboratories with factory R&D. By 1900, professional societies, journals, and standardized nomenclature coordinated an international chemical enterprise.",
    "image": "/media/images/technologyType/chemistry.jpg",
    "key": "technologyType:chemistry",
    "name": "Chemistry",
    "quote": {
      "text": "Chemistry turns earth into bread, cloth, and light.",
      "source": "German chemical society toast, 1889",
      "url": "/media/quotes/technologyType/chemistry.mp3"
    },
    "requires": ["technologyType:repeatingRifles", "technologyType:drilling"],
    "x": 6,
    "y": 88,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 506
      }
    ]
  },
  {
    "category": "eraType:imperial",
    "concept": "conceptType:technology",
    "description": "Combustion is rapid oxidation releasing heat and work. In the industrial era it moved from furnace and boiler practice to scientific design based on thermodynamics and gas chemistry. The Otto four‑stroke engine (1876) converted controlled gasoline combustion into rotary motion with higher efficiency than steam at small scales. Rudolf Diesel’s compression‑ignition engine (1897) used high pressures to ignite heavier fuels, improving fuel economy. Carburetion, ignition timing, and later fuel injection managed flame speed and knock. Internal combustion enabled automobiles, tractors, and light aircraft, while continued boiler firing powered ships and power plants. Study of emissions and flame dynamics followed.",
    "image": "/media/images/technologyType/combustion.jpg",
    "key": "technologyType:combustion",
    "name": "Combustion",
    "quote": {
      "text": "The age of distance is ended.",
      "source": "American automobile advertisement, 1906",
      "url": "/media/quotes/technologyType/combustion.mp3"
    },
    "requires": ["technologyType:drilling", "technologyType:liberalism"],
    "x": 10,
    "y": 88,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 506
      }
    ]
  },
  {
    "category": "eraType:imperial",
    "concept": "conceptType:technology",
    "description": "Universal suffrage denotes the removal of property and similar qualifications so that adults may vote as citizens. In 1848 France adopted universal male suffrage, setting a model for continental Europe. The United States’ Fifteenth Amendment (1870) barred racial restrictions on voting, though later state laws curtailed its effect until the twentieth century. New Zealand enfranchised women in 1893, followed by several territories and nations in the early 1900s. Secret ballots, voter registration, and redistricting practices evolved alongside the franchise. By the mid‑twentieth century, most industrial democracies had extended voting to women and working men, making mass electoral politics the norm.",
    "image": "/media/images/technologyType/universalSuffrage.jpg",
    "key": "technologyType:universalSuffrage",
    "name": "Universal Suffrage",
    "quote": {
      "text": "The vote of all is the strength of the state.",
      "source": "New Zealand election poster, 1893",
      "url": "/media/quotes/technologyType/universalSuffrage.mp3"
    },
    "requires": ["technologyType:liberalism"],
    "x": 14,
    "y": 88,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 506
      }
    ]
  },
  {
    "category": "eraType:modern",
    "concept": "conceptType:technology",
    "description": "Modern atomic theory in the early twentieth century located mass and positive charge in a compact nucleus with electrons occupying quantized states. Ernest Rutherford’s gold‑foil experiment (1911) demonstrated nuclear structure; Niels Bohr’s model (1913) applied quantum postulates to hydrogen spectra. Discovery of the neutron (1932) clarified isotopes and mass defects. Quantum mechanics in the 1920s–1930s replaced orbital pictures with wavefunctions and probabilistic interpretation, explaining chemical bonding and periodic behavior. Experimental tools—spectroscopy, scattering, cloud chambers, and later accelerators—validated subatomic particles and transitions. The framework unified physics and chemistry, enabling nuclear energy research, radiochemistry, semiconductor theory, and precise metrology.",
    "image": "/media/images/technologyType/atomicTheory.jpg",
    "key": "technologyType:atomicTheory",
    "name": "Atomic Theory",
    "quote": {
      "text": "Atoms are the bricks of the universe.",
      "source": "Physics lecture, University of Cambridge, ca. 1923",
      "url": "/media/quotes/technologyType/atomicTheory.mp3"
    },
    "requires": ["technologyType:trenchWarfare"],
    "x": 0,
    "y": 91,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 510
      }
    ]
  },
  {
    "category": "eraType:modern",
    "concept": "conceptType:technology",
    "description": "Stainless steel is an iron alloy with sufficient chromium, typically at least 10.5 percent, to form a passive oxide film that resists corrosion. Harry Brearley’s 1913 work in Sheffield identified martensitic grades suitable for cutlery and wear‑resistant parts. Rapid development produced ferritic and austenitic families; the 18‑8 composition (type 304) became a general‑purpose grade, while molybdenum‑bearing 316 improved resistance to chlorides. Electric arc furnaces and precise deoxidation enabled consistent quality. Early medical and food industries adopted stainless steel for hygienic surfaces, surgical tools, and processing equipment. Architectural cladding and kitchenware followed. Interwar standards and alloy taxonomy stabilized design practice.",
    "image": "/media/images/technologyType/stainlessSteel.jpg",
    "key": "technologyType:stainlessSteel",
    "name": "Stainless Steel",
    "quote": {
      "text": "Strength that endures when others rust away.",
      "source": "Sheffield steelworks slogan, ca. 1924",
      "url": "/media/quotes/technologyType/stainlessSteel.mp3"
    },
    "requires": ["technologyType:trenchWarfare", "technologyType:chemistry"],
    "x": 4,
    "y": 91,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 510
      }
    ]
  },
  {
    "category": "eraType:modern",
    "concept": "conceptType:technology",
    "description": "Oil refining separates and converts crude petroleum into usable fractions and petrochemicals. Nineteenth‑century refineries distilled kerosene for lighting, with lubricants and asphalt as byproducts. With the rise of automobiles, gasoline demand grew, prompting thermal cracking such as the Burton process (1913) to increase light fractions. In the 1930s, catalytic cracking units further improved yields and octane, enabling higher‑performance engines. Standard Oil and successor firms built integrated refinery networks near ports and pipelines. Hydrogenation, polymerization, and reforming added control over composition and stability. Refined products supplied transport fuels, solvents, and chemical feedstocks, anchoring a global energy and materials system.",
    "image": "/media/images/technologyType/oilRefining.jpg",
    "key": "technologyType:oilRefining",
    "name": "Oil Refining",
    "quote": {
      "text": "The oil business will grow as long as there is light in the world.",
      "source": "John D. Rockefeller, ca. 1880",
      "url": "/media/quotes/technologyType/oilRefining.mp3"
    },
    "requires": ["technologyType:chemistry", "technologyType:combustion"],
    "x": 8,
    "y": 91,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 510
      }
    ]
  },
  {
    "category": "eraType:modern",
    "concept": "conceptType:technology",
    "description": "Flight as a powered technology began with the Wright brothers’ sustained, controlled flights at Kitty Hawk in 1903, achieved through three‑axis control and lightweight propulsion. Rapid advances before and during World War I produced reconnaissance and fighter aircraft, standardized airframes, and aero engines such as the rotary and inline types. Metal construction, stressed‑skin techniques, and wind‑tunnel testing improved strength and efficiency. In civil aviation, the Douglas DC‑3 (mid‑1930s) established reliable, economical passenger service on major routes. Airfields, navigation aids, and regulatory regimes formed a comprehensive infrastructure. By mid‑century, fixed‑wing and rotary‑wing flight supported transport, communication, and military doctrine worldwide.",
    "image": "/media/images/technologyType/flight.jpg",
    "key": "technologyType:flight",
    "name": "Flight",
    "quote": {
      "text": "The desire to fly is an idea handed down to us by our ancestors.",
      "source": "Wilbur Wright, 1901",
      "url": "/media/quotes/technologyType/flight.mp3"
    },
    "requires": ["technologyType:combustion", "technologyType:universalSuffrage"],
    "x": 12,
    "y": 91,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 510
      }
    ]
  },
  {
    "category": "eraType:modern",
    "concept": "conceptType:technology",
    "description": "Hydrodynamics applied the study of fluid motion to the design and operation of ships, turbines, and hydraulic structures supporting industrial economies and modern navies. Engineers analyzed resistance, buoyancy, and flow behavior to refine hull shapes, propellers, and rudders, improving speed, efficiency, and stability under varying conditions. Experimental towing tanks and mathematical models enabled systematic testing and optimization of vessel performance. Hydraulic principles governed the construction of dams, spillways, and turbines that converted moving water into mechanical and electrical power. Dry docks used controlled flooding and pumping systems to support ship construction and maintenance below the waterline. These applications allowed states and industries to expand maritime transport, naval capability, and large-scale energy production through controlled interaction with moving fluids.",
    "image": "/media/images/technologyType/hydrodynamics.jpg",
    "key": "technologyType:hydrodynamics",
    "name": "Hydrodynamics",
    "quote": {
      "text": "A dam is a fortress against the river.",
      "source": "U.S. Bureau of Reclamation engineer, ca. 1935",
      "url": "/media/quotes/technologyType/hydrodynamics.mp3"
    },
    "requires": ["technologyType:atomicTheory", "technologyType:stainlessSteel"],
    "x": 2,
    "y": 93,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 540
      }
    ]
  },
  {
    "category": "eraType:modern",
    "concept": "conceptType:technology",
    "description": "Tracked treads are continuous track systems that spread vehicle weight over a large contact area, lowering ground pressure and improving traction on soft or uneven terrain. Early agricultural crawlers by Holt laid the groundwork for military adoption. The British Mark I tank in World War I validated the concept in combat by crossing trenches and shell craters. Interwar development produced more reliable suspensions and track metallurgy. In World War II, designs such as the Soviet T-34 combined wide tracks with sloped armor and robust powertrains, proving decisive on the Eastern Front. Civilian use expanded through Caterpillar tractors, bulldozers, and excavators, enabling large-scale earthmoving, forestry, and construction. Modern tracked systems employ rubber composites, modular links, and torsion bar or hydropneumatic suspensions for durability and ride quality.",
    "image": "/media/images/technologyType/trackedTreads.jpg",
    "key": "technologyType:trackedTreads",
    "name": "Tracked Treads",
    "quote": {
      "text": "Our armor is strong, and our tanks are fast.",
      "source": "March of the Tankmen, 1939",
      "url": "/media/quotes/technologyType/trackedTreads.mp3"
    },
    "requires": ["technologyType:stainlessSteel", "technologyType:oilRefining"],
    "x": 6,
    "y": 93,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 540
      }
    ]
  },
  {
    "category": "eraType:modern",
    "concept": "conceptType:technology",
    "description": "Rocketry uses reaction propulsion to accelerate vehicles by expelling high-velocity exhaust. The field matured in the 20th century with liquid-fuel engines and guidance systems. Wartime advances culminated in the German V-2, the first long-range ballistic missile and a template for postwar programs. The Cold War drove rapid progress in boosters, telemetry, and staging, enabling the launch of Sputnik in 1957 and human spaceflight soon after. Heavy-lift vehicles such as the Saturn V enabled lunar missions and large orbital payloads. Parallel development produced military ICBMs, tactical rockets, and high-altitude sounding rockets for atmospheric and scientific research. Key institutions built test ranges, propulsion labs, and tracking networks, establishing the infrastructure for modern space operations and planetary exploration.",
    "image": "/media/images/technologyType/rocketry.jpg",
    "key": "technologyType:rocketry",
    "name": "Rocketry",
    "quote": {
      "text": "The rocket is the weapon of the future.",
      "source": "Wernher von Braun, 1944",
      "url": "/media/quotes/technologyType/rocketry.mp3"
    },
    "requires": ["technologyType:oilRefining", "technologyType:flight"],
    "x": 10,
    "y": 93,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 540
      }
    ]
  },
  {
    "category": "eraType:modern",
    "concept": "conceptType:technology",
    "description": "Radio transmits information by modulating electromagnetic waves and detecting them at a receiver. Practical systems followed early wireless telegraphy, with Guglielmo Marconi’s 1901 transatlantic signal proving long-range propagation. The 1920s saw commercial broadcasting, network syndication, and household receivers, shaped by AM standards and superheterodyne circuits. Regulatory frameworks emerged to allocate spectrum and reduce interference. During World War II, radio supported command, navigation, and intelligence, from HF links to short-range tactical sets. Postwar advances introduced FM broadcasting with improved fidelity and noise resistance, as well as miniaturization through vacuum tubes and then transistors. Radio underpinned emergency services, maritime and aviation communication, and later cellular and satellite systems through shared engineering principles.",
    "image": "/media/images/technologyType/radio.jpg",
    "key": "technologyType:radio",
    "name": "Radio",
    "quote": {
      "text": "Swing travels faster than any train.",
      "source": "American music magazine, ca. 1938",
      "url": "/media/quotes/technologyType/radio.mp3"
    },
    "requires": ["technologyType:flight"],
    "x": 14,
    "y": 93,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 540
      }
    ]
  },
  {
    "category": "eraType:modern",
    "concept": "conceptType:technology",
    "description": "Submarines employed submersible hulls, ballast systems, and propulsion machinery to operate beneath the water’s surface for extended periods, enabling covert movement, reconnaissance, and attack. Early designs used hand-powered or compressed-air propulsion, while later vessels adopted diesel-electric and electric battery systems to balance submerged endurance with surface range. Ballast tanks regulated buoyancy by admitting or expelling water, allowing controlled diving, surfacing, and depth stability. Pressure-resistant hulls and periscopes enabled navigation and observation while submerged, and torpedoes provided offensive capability against ships and infrastructure. Naval institutions developed specialized training, maintenance, and operational doctrine for underwater warfare. Submarines altered naval strategy by enabling concealed approach, disrupting supply lines, and extending military presence below the surface domain.",
    "image": "/media/images/technologyType/submarines.jpg",
    "key": "technologyType:submarines",
    "name": "Submarines",
    "quote": {
      "text": "The sea is everything. It covers seven tenths of the terrestrial globe.",
      "source": "Jules Verne, 1870",
      "url": "/media/quotes/technologyType/submarines.mp3"
    },
    "requires": ["technologyType:hydrodynamics"],
    "x": 0,
    "y": 95,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 570
      }
    ]
  },
  {
    "category": "eraType:modern",
    "concept": "conceptType:technology",
    "description": "Antibiotics are compounds that kill or inhibit bacteria, transforming clinical outcomes for infectious disease. Sulfonamides in the 1930s offered the first widely used synthetic antibacterials. Penicillin, discovered by Alexander Fleming and mass-produced during World War II through deep-tank fermentation, reduced mortality from wound infections and pneumonia. Streptomycin, isolated in 1943, opened effective treatment for tuberculosis and broadened the spectrum against Gram-negative organisms. Postwar discovery programs yielded tetracyclines, macrolides, and cephalosporins, while semisynthetic modifications improved stability and dosing. Widespread use in medicine and agriculture selected for resistance, prompting stewardship, surveillance, and combination therapies. Manufacturing integrated strain selection, bioreactors, and purification, embedding antibiotics into modern public health and surgical practice.",
    "image": "/media/images/technologyType/antibiotics.jpg",
    "key": "technologyType:antibiotics",
    "name": "Antibiotics",
    "quote": {
      "text": "The miracle in the mold.",
      "source": "Alexander Fleming, 1945",
      "url": "/media/quotes/technologyType/antibiotics.mp3"
    },
    "requires": ["technologyType:atomicTheory", "technologyType:trackedTreads"],
    "x": 4,
    "y": 95,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 570
      }
    ]
  },
  {
    "category": "eraType:modern",
    "concept": "conceptType:technology",
    "description": "Art Deco was a global design movement of the 1920s and 1930s, uniting geometric forms with modern materials and a polished machine-age aesthetic. It drew visibility from the 1925 Exposition Internationale des Arts Décoratifs et Industriels Modernes in Paris. Architecture and interiors employed chrome, lacquer, exotic woods, and glass to convey luxury and speed. The Chrysler Building in New York displayed stylized motifs and stepped massing. Ocean liners such as SS Normandie showcased streamlined ornament and integrated lighting. Graphic arts used bold color blocks, sans-serif type, and stylized figures in posters and packaging. Regional variants emerged in North America, Europe, South Asia, and Latin America. After World War II its influence waned as International Style modernism advanced, later returning through heritage preservation.",
    "image": "/media/images/technologyType/artDeco.jpg",
    "key": "technologyType:artDeco",
    "name": "Art Deco",
    "quote": {
      "text": "The city wears its finest dress in steel.",
      "source": "New York architecture review, ca. 1931",
      "url": "/media/quotes/technologyType/artDeco.mp3"
    },
    "requires": ["technologyType:trackedTreads", "technologyType:rocketry"],
    "x": 8,
    "y": 95,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 570
      }
    ]
  },
  {
    "category": "eraType:modern",
    "concept": "conceptType:technology",
    "description": "Aerodynamics examines airflow and the forces it produces on moving bodies. Early aviation coupled wind-tunnel testing with theory to establish lift, drag, and stability criteria. Ludwig Prandtl’s boundary-layer concept and NACA’s systematic airfoil series gave designers reliable performance data. Compressibility effects at high speed prompted study of shock waves, critical Mach number, and transonic behavior. Supersonic wind tunnels and schlieren imaging enabled research on cones, wedges, and area ruling. The jet age demanded refined inlet, nozzle, and wing designs, while missiles required slender bodies and control in rarified regimes. Postwar advances merged experiments with numerical methods, and later computational fluid dynamics, guiding aircraft, rotorcraft, and reentry vehicles. The field remains central to fuel efficiency, noise control, and high-speed flight.",
    "image": "/media/images/technologyType/aerodynamics.jpg",
    "key": "technologyType:aerodynamics",
    "name": "Aerodynamics",
    "quote": {
      "text": "Sleek lines win the race before it starts.",
      "source": "German automotive poster, ca. 1936",
      "url": "/media/quotes/technologyType/aerodynamics.mp3"
    },
    "requires": ["technologyType:rocketry", "technologyType:radio"],
    "x": 12,
    "y": 95,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 570
      }
    ]
  },
  {
    "category": "eraType:atomic",
    "concept": "conceptType:technology",
    "description": "Aluminum milling is the precision removal of material from aluminum alloys using rotating cutters. The process grew with the widespread availability of aluminum after the Hall–Héroult process and the demands of airframe production. High spindle speeds, sharp rake geometries, and flood coolants enable clean shear and chip evacuation while limiting built-up edge. World War II production standardized fixtures, jigs, and tolerance control for ribs, spars, and skins. Postwar, numerically controlled and later CNC machine tools delivered repeatability and complex contours, including monolithic milled structures that reduce fasteners and weight. Automotive and consumer goods adopted similar methods for lightweight components. Tooling evolved to carbide and coated cutters, while fixturing and probing improved accuracy on thin-walled parts.",
    "image": "/media/images/technologyType/aluminumMilling.jpg",
    "key": "technologyType:aluminumMilling",
    "name": "Aluminum Milling",
    "quote": {
      "text": "This is aluminum, aluminum for our industries and aluminum for our homes.",
      "source": "Aluminum on the March, 1956",
      "url": "/media/quotes/technologyType/aluminumMilling.mp3"
    },
    "requires": ["technologyType:submarines", "technologyType:antibiotics"],
    "x": 2,
    "y": 98,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 580
      }
    ]
  },
  {
    "category": "eraType:atomic",
    "concept": "conceptType:technology",
    "description": "Nuclear fission splits heavy nuclei such as uranium-235 into lighter fragments, releasing energy and neutrons. The phenomenon was identified in 1938–1939 and enabled self-sustaining chain reactions under controlled conditions. Chicago Pile-1 achieved the first controlled reaction in 1942, proving the feasibility of engineered criticality with moderators and control rods. The Manhattan Project applied fission to weapons through isotope separation, reactor physics, and implosion systems. Postwar development produced power reactors that convert fission heat to electricity using steam cycles, with light-water designs becoming standard. Safeguards, containment, and fuel cycles evolved alongside concerns over waste and proliferation. Fission also supported isotope production for medicine and industry, embedding reactor technology into national energy and research programs.",
    "image": "/media/images/technologyType/fission.jpg",
    "key": "technologyType:fission",
    "name": "Fission",
    "quote": {
      "text": "Mass and energy are both but different manifestations of the same thing.",
      "source": "Albert Einstein, 1948",
      "url": "/media/quotes/technologyType/fission.mp3"
    },
    "requires": ["technologyType:antibiotics", "technologyType:artDeco"],
    "x": 6,
    "y": 98,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 580
      }
    ]
  },
  {
    "category": "eraType:atomic",
    "concept": "conceptType:technology",
    "description": "Mass media comprises technologies that deliver information to large audiences at once. In the early 20th century, newspapers and cinema newsreels reached urban publics. National radio networks in the 1920s and 1930s created shared programming and real-time news. During World War II, radio became central to propaganda, coordination, and morale. Postwar broadcast television unified entertainment and advertising, shaping political campaigns and consumer culture. Regulatory bodies managed spectrum, ownership, and content standards. The system provided a template for later cable and satellite distribution and for global news agencies.",
    "image": "/media/images/technologyType/massMedia.jpg",
    "key": "technologyType:massMedia",
    "name": "Mass Media",
    "quote": {
      "text": "And that’s the way it is.",
      "source": "Walter Cronkite, 1962",
      "url": "/media/quotes/technologyType/massMedia.mp3"
    },
    "requires": ["technologyType:artDeco", "technologyType:aerodynamics"],
    "x": 10,
    "y": 98,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 580
      }
    ]
  },
  {
    "category": "eraType:atomic",
    "concept": "conceptType:technology",
    "description": "Civil defense comprises government programs to protect civilians from attack and major disasters. In the Second World War, Britain organized air raid wardens, enforced blackouts, and built shelters that sustained London during the Blitz. The United States created warning networks and CONELRAD sirens in the early Cold War. Drills, evacuation plans, and fallout shelter mapping followed. Many countries folded civil defense into broader emergency management after the 1960s. The focus shifted toward communication, evacuation, and continuity of government under conventional and technological hazards. Modern systems coordinate local responders, public alerts, and infrastructure protection while retaining contingency plans for aerial and missile threats.",
    "image": "/media/images/technologyType/civilDefense.jpg",
    "key": "technologyType:civilDefense",
    "name": "Civil Defense",
    "quote": {
      "text": "Duck and cover!",
      "source": "U.S. Federal Civil Defense Administration film, 1951",
      "url": "/media/quotes/technologyType/civilDefense.mp3"
    },
    "requires": ["technologyType:aerodynamics"],
    "x": 14,
    "y": 98,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 580
      }
    ]
  },
  {
    "category": "eraType:atomic",
    "concept": "conceptType:technology",
    "description": "Automatic carbines are compact, shoulder-fired rifles with selective or fully automatic fire. They are optimized for close to medium ranges and mobile troops. The type grew from interwar work on lightweight self-loading arms and matured in World War II. The U.S. M2 Carbine added burst fire for infantry and rear-echelon units in the Korean War. The Soviet AKS-74U condensed assault-rifle firepower for vehicle crews and special forces. It traded barrel length for portability. Later, modular bullpup designs such as the FN F2000 integrated optics, rails, and improved ergonomics. Automatic carbines shaped urban tactics, convoy defense, and airborne operations. They bridged the gap between submachine guns and standard assault rifles.",
    "image": "/media/images/technologyType/automaticCarbines.jpg",
    "key": "technologyType:automaticCarbines",
    "name": "Automatic Carbines",
    "quote": {
      "text": "An individual weapon intended to destroy enemy personnel.",
      "source": "AKM Field Manual (USSR), 1970",
      "url": "/media/quotes/technologyType/automaticCarbines.mp3"
    },
    "requires": ["technologyType:aluminumMilling"],
    "x": 2,
    "y": 100,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 612
      }
    ]
  },
  {
    "category": "eraType:atomic",
    "concept": "conceptType:technology",
    "description": "A thermonuclear device uses a staged design. A fission primary ignites fusion fuel in a secondary, multiplying yield far beyond first-generation atomic bombs. The Teller–Ulam configuration was proven by the U.S. Ivy Mike test in 1952. It established practical radiation implosion and staging. Subsequent designs adopted lithium deuteride fuel and efficient secondaries. Castle Bravo in 1954 produced an unexpectedly high yield due to fuel reactions. The Soviet RDS-220, or Tsar Bomba, in 1961 showed maximum deliverable yield under test conditions. Thermonuclear weapons reshaped strategy and deterrence. They also drove arms control, from the Partial Test Ban Treaty to later limits on testing, delivery systems, and warheads.",
    "image": "/media/images/technologyType/thermonuclearDevice.jpg",
    "key": "technologyType:thermonuclearDevice",
    "name": "Thermonuclear Device",
    "quote": {
      "text": "Remember your humanity, and forget the rest.",
      "source": "Russell–Einstein Manifesto, 1955",
      "url": "/media/quotes/technologyType/thermonuclearDevice.mp3"
    },
    "requires": [
      "technologyType:aluminumMilling",
      "technologyType:fission",
      "technologyType:massMedia"
    ],
    "x": 6,
    "y": 100,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 612
      }
    ]
  },
  {
    "category": "eraType:atomic",
    "concept": "conceptType:technology",
    "description": "Ballistics studies projectile behavior in three domains: internal, external, and terminal. Industrial-age artillery produced formal firing tables and new instruments. World War I methods accounted for propellant temperature, barrel wear, wind, and the rotation of the Earth. Rocket and missile programs extended external ballistics to supersonic and exoatmospheric flight. V-2 work drove early trajectory computation. Cold War research modeled reentry for ICBMs, including ablation, plasma effects, and accuracy. Modern ballistics supports forensic analysis, guided weapons, and computational fluid dynamics. It links weapon design to target effects and survivability.",
    "image": "/media/images/technologyType/ballistics.jpg",
    "key": "technologyType:ballistics",
    "name": "Ballistics",
    "quote": {
      "text": "When Barbicane proposed to send a projectile to the Moon…",
      "source": "Jules Verne, 1865",
      "url": "/media/quotes/technologyType/ballistics.mp3"
    },
    "requires": ["technologyType:massMedia"],
    "x": 10,
    "y": 100,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 612
      }
    ]
  },
  {
    "category": "eraType:atomic",
    "concept": "conceptType:technology",
    "description": "Guidance systems direct vehicles or missiles to a target with autonomy and accuracy. Sensors determine orientation, position, or emissions. Control laws then command surfaces or thrust. Early systems combined gyroscopes with analog computers, as in the V-2. Heat-seeking air-to-air missiles, such as the AIM-9 Sidewinder, added compact sensors and feedback logic for terminal homing. Inertial guidance matured with stable platforms and digital computing. The Apollo Guidance Computer enabled deep-space navigation. Later integration with radio navigation and satellites improved precision and reduced circular error probable. Weather and night limitations eased as guidance improved.",
    "image": "/media/images/technologyType/guidanceSystems.jpg",
    "key": "technologyType:guidanceSystems",
    "name": "Guidance Systems",
    "quote": {
      "text": "We can hit a dime from a thousand miles.",
      "source": "Raytheon promotional film, 1968",
      "url": "/media/quotes/technologyType/guidanceSystems.mp3"
    },
    "requires": ["technologyType:civilDefense"],
    "x": 14,
    "y": 100,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 612
      }
    ]
  },
  {
    "category": "eraType:atomic",
    "concept": "conceptType:technology",
    "description": "Plastics are synthetic polymers shaped by molding, extrusion, or casting. Early milestones included Bakelite in 1907, which enabled heat‑resistant electrical housings. Nylon served in parachutes and cords during wartime when natural fibers were scarce. Postwar polyethylene and polypropylene supported mass packaging, consumer goods, and insulation. PVC became standard for pipes and cable sheathing. Low cost and versatility drove adoption in electronics, medicine, and aerospace. Environmental impacts later prompted recycling, material redesign, and regulation of additives. Plastics remain central to manufacturing, from composite matrices to feedstocks for 3D printing.",
    "image": "/media/images/technologyType/plastics.jpg",
    "key": "technologyType:plastics",
    "name": "Plastics",
    "quote": {
      "text": "Molding a Bright Future in Plastics.",
      "source": "Dow advertisement, 1952",
      "url": "/media/quotes/technologyType/plastics.mp3"
    },
    "requires": ["technologyType:automaticCarbines"],
    "x": 2,
    "y": 102,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 644
      }
    ]
  },
  {
    "category": "eraType:atomic",
    "concept": "conceptType:technology",
    "description": "Nuclear propulsion uses a fission reactor to produce heat for movement. In ships, pressurized‑water reactors drive turbines and give long endurance without refueling. The USS Nautilus demonstrated sustained submerged speed in 1955 and transpolar navigation in 1958. Soviet nuclear icebreakers enabled year‑round Arctic operations. Space concepts pursued direct thermal thrust. The U.S. NERVA program heated hydrogen to achieve high exhaust velocity during tests in the 1960s and 1970s. Operational safety, shielding, and fuel logistics shape design. Strategic and economic factors limit adoption to roles that demand extended range, high power density, and minimal logistic dependence.",
    "image": "/media/images/technologyType/nuclearPropulsion.jpg",
    "key": "technologyType:nuclearPropulsion",
    "name": "Nuclear Propulsion",
    "quote": {
      "text": "U.S.S. Nautilus has reach the North Pole.",
      "source": "William R. Anderson, 1958.",
      "url": "/media/quotes/technologyType/nuclearPropulsion.mp3"
    },
    "requires": ["technologyType:thermonuclearDevice"],
    "x": 6,
    "y": 102,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 644
      }
    ]
  },
  {
    "category": "eraType:atomic",
    "concept": "conceptType:technology",
    "description": "Supersonic flight begins when an aircraft exceeds Mach 1. Designers must manage compressibility, shock waves, and transonic drag rise. The Bell X‑1 achieved the first controlled supersonic flight in 1947. Swept wings and area ruling followed in production aircraft. Military types used afterburning turbojets and variable inlets to control shocks. Civil efforts peaked with Concorde, which flew transatlantic service from 1976 to 2003. The SR‑71 Blackbird demonstrated high supersonic speed and altitude with specialized materials and fuels. Noise, fuel burn, and emissions drove research into low‑boom configurations and efficient transports.",
    "image": "/media/images/technologyType/supersonicFlight.jpg",
    "key": "technologyType:supersonicFlight",
    "name": "Supersonic Flight",
    "quote": {
      "text": "The real barrier wasn’t in the sky but in our knowledge.",
      "source": "Chuck Yeager, 1985",
      "url": "/media/quotes/technologyType/supersonicFlight.mp3"
    },
    "requires": ["technologyType:ballistics", "technologyType:guidanceSystems"],
    "x": 10,
    "y": 102,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 644
      }
    ]
  },
  {
    "category": "eraType:digital",
    "concept": "conceptType:technology",
    "description": "Combined arms integrated infantry, cavalry, artillery, and later mechanized and air units into coordinated formations that applied complementary strengths against enemy forces. Commanders organized units to support one another, with infantry holding ground, cavalry or mobile forces maneuvering, and artillery disrupting formations and defenses at range. Communication systems, standardized drill, and staff planning enabled synchronized movement and timing across diverse units. Logistics supplied ammunition, equipment, and transport to sustain operations over distance. This coordination reduced the vulnerabilities of individual unit types and increased battlefield effectiveness. Combined arms allowed militaries to conduct offensive and defensive operations with greater flexibility, concentration of force, and operational control across complex and changing combat conditions.",
    "image": "/media/images/technologyType/combinedArms.jpg",
    "key": "technologyType:combinedArms",
    "name": "Combined Arms",
    "quote": {
      "text": "I ain't no fortunate son...",
      "source": "Creedence Clearwater Revival, 1969",
      "url": "/media/quotes/technologyType/combinedArms.mp3"
    },
    "requires": ["technologyType:plastics"],
    "x": 0,
    "y": 105,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 650
      }
    ]
  },
  {
    "category": "eraType:digital",
    "concept": "conceptType:technology",
    "description": "Transistors are semiconductor devices that switch or amplify signals by controlling charge carriers in doped materials. The 1947 Bell Labs point‑contact transistor proved solid‑state amplification. Junction and planar devices soon surpassed it. Miniaturization advanced through photolithography and improved silicon purity. This enabled transistor radios and early computers such as the IBM 1401. Integrated circuits grouped many transistors on one die and transformed computing, communications, and control. The MOSFET became dominant and scaled under Moore’s Law to billions per chip. Low power, ruggedness, and mass manufacturability let transistors displace vacuum tubes and anchor the global electronics industry.",
    "image": "/media/images/technologyType/transistors.jpg",
    "key": "technologyType:transistors",
    "name": "Transistors",
    "quote": {
      "text": "In these robot brains the transistor is the ideal nerve cell.",
      "source": "William Shockley, 1949",
      "url": "/media/quotes/technologyType/transistors.mp3"
    },
    "requires": ["technologyType:plastics", "technologyType:nuclearPropulsion"],
    "x": 4,
    "y": 105,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 650
      }
    ]
  },
  {
    "category": "eraType:digital",
    "concept": "conceptType:technology",
    "description": "Space flight emerged from theoretical work by Tsiolkovsky and early rocketry by Goddard and Oberth. World War II V-2 developments fed postwar programs in the United States and USSR. Sputnik 1 in 1957 opened the orbital era, followed by human spaceflight with Vostok 1 in 1961. Apollo 11 reached the Moon in 1969, demonstrating high-energy launch vehicles, guidance, and life support. The 1970s and 1980s saw long-duration stations and reusable concepts such as the Space Shuttle, while Soyuz provided sustained crewed access. Uncrewed exploration expanded with planetary probes and Earth observation. The 1990s commercialization and international partnerships supported the International Space Station. Since 2010, reusable boosters, private launch providers, and smallsat constellations have reshaped access. Interplanetary goals revived with Mars rovers and sample-return missions.",
    "image": "/media/images/technologyType/spaceFlight.jpg",
    "key": "technologyType:spaceFlight",
    "name": "Space Flight",
    "quote": {
      "text": "Beep... beep.... beep... beep...",
      "source": "Sputnik, 1957",
      "url": "/media/quotes/technologyType/spaceFlight.mp3"
    },
    "requires": ["technologyType:nuclearPropulsion", "technologyType:supersonicFlight"],
    "x": 8,
    "y": 105,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 650
      }
    ]
  },
  {
    "category": "eraType:digital",
    "concept": "conceptType:technology",
    "description": "The hollow charge, or shaped charge, concentrates explosive energy into a high-velocity metal jet. The effect was explored in the late nineteenth century and refined in the 1930s by researchers such as Birkhoff. During World War II, HEAT warheads gave infantry a practical counter to armor, seen in the bazooka and Panzerfaust. Postwar designs improved liners, standoff, and wave shaping, extending utility to demolition, oil-well perforation, and anti-armor missiles. Reactive armor spurred tandem-charge solutions to defeat countermeasures. The RPG-7 and similar systems spread globally due to simplicity and effectiveness. Modern variants employ precursor charges, optimized liners, and multipurpose fuzes for bunkers and vehicles. Despite active protection systems, the shaped charge remains a core anti-armor mechanism.",
    "image": "/media/images/technologyType/hollowCharge.jpg",
    "key": "technologyType:hollowCharge",
    "name": "Hollow Charge",
    "quote": {
      "text": "RPGs are cheap, simple, and lethal—any soldier can become a tank breaker.",
      "source": "ARES conflict report, 2000",
      "url": "/media/quotes/technologyType/hollowCharge.mp3"
    },
    "requires": ["technologyType:supersonicFlight"],
    "x": 12,
    "y": 105,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 650
      }
    ]
  },
  {
    "category": "eraType:digital",
    "concept": "conceptType:technology",
    "description": "",
    "image": "/media/images/technologyType/religiousRevival.jpg",
    "key": "technologyType:religiousRevival",
    "name": "Religious Revival",
    "quote": {
      "text": "I have a dream!",
      "source": "Martin Luther King, 1963",
      "url": "/media/quotes/technologyType/religiousRevival.mp3"
    },
    "requires": ["technologyType:combinedArms", "technologyType:transistors"],
    "x": 2,
    "y": 107,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 684
      }
    ]
  },
  {
    "category": "eraType:digital",
    "concept": "conceptType:technology",
    "description": "Integrated circuits compressed transistors, resistors, and interconnects onto semiconductor wafers. Jack Kilby and Robert Noyce introduced the concept and the planar process at the end of the 1950s, enabling reliable mass production at Fairchild. Early ICs powered avionics such as the Apollo guidance computer. The 1971 Intel 4004 marked the microprocessor’s arrival, integrating a CPU on a single chip. Scaling and photolithography advances produced large-scale and very-large-scale integration and fueled Moore’s law. Microchips transformed computing, communications, and control systems, from calculators and radios to mainframes and personal computers. By the late twentieth century, semiconductor fabrication, EDA tools, and global supply chains made microchips a strategic industry. Today, system-on-chip designs support mobile devices, data centers, and embedded systems.",
    "image": "/media/images/technologyType/microchips.jpg",
    "key": "technologyType:microchips",
    "name": "Microchips",
    "quote": {
      "text": "Integrated circuits will lead to such wonders as home computers.",
      "source": "Gordon Moore, 1965",
      "url": "/media/quotes/technologyType/microchips.mp3"
    },
    "requires": ["technologyType:transistors", "technologyType:spaceFlight"],
    "x": 6,
    "y": 107,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 684
      }
    ]
  },
  {
    "category": "eraType:digital",
    "concept": "conceptType:technology",
    "description": "State surveillance comprises collection and analysis of information on populations, opponents, and threats. Methods evolved from paper records and informant networks to wiretaps and digital interception. The Stasi compiled extensive files in East Germany. COINTELPRO targeted groups within the United States during the Cold War. The ECHELON network automated global signals intelligence. After 2001, bulk metadata, internet monitoring, and camera networks expanded capabilities. Legal frameworks, oversight, and public debate continue to shape these practices.",
    "image": "/media/images/technologyType/stateSurveillance.jpg",
    "key": "technologyType:stateSurveillance",
    "name": "State Surveillance",
    "quote": {
      "text": "Big Brother is watching you.",
      "source": "George Orwell, Nineteen Eighty-Four, 1949",
      "url": "/media/quotes/technologyType/stateSurveillance.mp3"
    },
    "requires": ["technologyType:spaceFlight", "technologyType:hollowCharge"],
    "x": 10,
    "y": 107,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 684
      }
    ]
  },
  {
    "category": "eraType:digital",
    "concept": "conceptType:technology",
    "description": "Globalization is the integration of markets, finance, production, and information across borders. The containerization boom cut transport costs and standardized logistics. Trade agreements such as NAFTA and the creation of the WTO in 1995 accelerated flows of goods and services. Outsourcing and multinational supply chains spread manufacturing and design. Telecommunications and the internet tightened coordination. Periodic shocks, including financial crises and pandemics, tested the system yet also prompted supply-chain reconfiguration and regional diversification.",
    "image": "/media/images/technologyType/globalization.jpg",
    "key": "technologyType:globalization",
    "name": "Globalization",
    "quote": {
      "text": "Globalization is not a policy choice; it is a fact",
      "source": "Kofi Annan, 1997",
      "url": "/media/quotes/technologyType/globalization.mp3"
    },
    "requires": ["technologyType:religiousRevival"],
    "x": 0,
    "y": 109,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 718
      }
    ]
  },
  {
    "category": "eraType:digital",
    "concept": "conceptType:technology",
    "description": "Guided ordnance uses sensors and control systems to steer weapons onto targets. Early methods included command guidance and beam riding. Semi-active laser, imaging infrared, and active radar seekers improved terminal accuracy. Inertial navigation and GPS enabled long-range precision strike. Laser-guided bombs such as Paveway demonstrated accuracy in Vietnam and matured by the 1991 Gulf War. Cruise missiles like the Tomahawk combined terrain matching, inertial guidance, and satellite updates for deep strikes. Anti-ship systems such as the AGM-84 Harpoon used active radar homing for sea control. Digital flight computers, data links, and target recognition increased flexibility. Countermeasures drove advances in ECCM, dual-mode seekers, and networking for cooperative engagement.",
    "image": "/media/images/technologyType/guidedOrdnance.jpg",
    "key": "technologyType:guidedOrdnance",
    "name": "Guided Ordnance",
    "quote": {
      "text": "If you are in a position to fire the gun, you have made some mistake.",
      "source": "USAF Red Baron II pilot debrief, 1966",
      "url": "/media/quotes/technologyType/guidedOrdnance.mp3"
    },
    "requires": [
      "technologyType:microchips",
      "technologyType:religiousRevival",
      "technologyType:stateSurveillance"
    ],
    "x": 6,
    "y": 109,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 718
      }
    ]
  },
  {
    "category": "eraType:information",
    "concept": "conceptType:technology",
    "description": "The internet is a global packet-switched network built on interoperable protocols. ARPANET pioneered resource sharing in the late 1960s. TCP/IP standardized internetworking in 1983 and spread via NSFNET to universities and research labs. The World Wide Web, created by Tim Berners-Lee in 1989–1991, provided a hypertext layer for public use. Commercial ISPs and deregulation in the 1990s expanded access. The network grew to support email, search, e-commerce, and streaming. Broadband, mobile data, and cloud computing enabled global platforms and services. Governance relies on open standards through the IETF and coordination by bodies such as ICANN for naming and addressing. Security, privacy, and scalability remain central engineering and policy concerns.",
    "image": "/media/images/technologyType/internet.jpg",
    "key": "technologyType:internet",
    "name": "Internet",
    "quote": {
      "text": "Don’t be evil.",
      "source": "Google corporate motto, 2000",
      "url": "/media/quotes/technologyType/internet.mp3"
    },
    "requires": ["technologyType:globalization", "technologyType:guidedOrdnance"],
    "x": 2,
    "y": 112,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 720
      }
    ]
  },
  {
    "category": "eraType:information",
    "concept": "conceptType:technology",
    "description": "A global army denotes multinational formations and operations under shared command, doctrine, and logistics. Interoperability depends on common standards, liaison teams, and secure communications. Examples include NATO’s ISAF in Afghanistan, UN peacekeeping brigades, and the broad coalition in Operation Desert Storm. Such forces balance national caveats with unified planning and rules of engagement. Rotational deployments, pooled enablers, and combined training underpin sustained expeditionary capacity.",
    "image": "/media/images/technologyType/globalArmy.jpg",
    "key": "technologyType:globalArmy",
    "name": "Global Army",
    "quote": {
      "text": "NATO does not have the ambition to become a ‘global policeman’.",
      "source": "Jaap de Hoop Scheffer, 2008",
      "url": "/media/quotes/technologyType/globalArmy.mp3"
    },
    "requires": ["technologyType:guidedOrdnance"],
    "x": 6,
    "y": 112,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 720
      }
    ]
  },
  {
    "category": "eraType:information",
    "concept": "conceptType:technology",
    "description": "Rifle scopes are optical sights that magnify targets and provide aiming references. Nineteenth-century telescopic sights saw early use, with mass adoption in the twentieth century for sniping and marksmanship. Modern designs feature variable magnification, coated lenses, illuminated reticles, and range-compensation marks. After 2000, military forces widely fielded rugged optics such as the ACOG, improving speed and accuracy. Thermal and image-intensified sights expanded night and adverse-weather capability in Iraq and Afghanistan. Digital aids, including ballistic calculators and networked smart optics like TrackingPoint, demonstrated enhanced first-round hit probability, though adoption remains selective due to cost and complexity.",
    "image": "/media/images/technologyType/rifleScopes.jpg",
    "key": "technologyType:rifleScopes",
    "name": "Rifle Scopes",
    "quote": {
      "text": "Rugged. Reliable. Repeatable.",
      "source": "Nightforce Optics motto, ca. 2000",
      "url": "/media/quotes/technologyType/rifleScopes.mp3"
    },
    "requires": ["technologyType:guidedOrdnance"],
    "x": 10,
    "y": 112,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 720
      }
    ]
  },
  {
    "category": "eraType:information",
    "concept": "conceptType:technology",
    "description": "Genetics is the study of heredity and the manipulation of genes for medicine and biotechnology. From Mendel’s work on inheritance and the discovery of DNA’s structure, the field advanced through recombinant DNA and PCR. Completion of the Human Genome Project in 2003 delivered a reference genome and accelerated high‑throughput sequencing. In the 2010s, CRISPR‑Cas9 brought precise, programmable editing across organisms, enabling functional genomics and experimental therapies. Clinical use expanded to carrier screening, targeted oncology, and pharmacogenomics. CAR‑T therapies gained approvals in 2017 for certain leukemias and lymphomas, proving engineered immune cells could achieve durable remissions. Agriculture applied genetic tools to crop improvement and disease resistance. Ethical and regulatory debate intensified over germline editing, privacy, and access. By the early 21st century, genetics underpinned personalized medicine, synthetic biology, and rapid pathogen analysis.",
    "image": "/media/images/technologyType/genetics.jpg",
    "key": "technologyType:genetics",
    "name": "Genetics",
    "quote": {
      "text": "Life is written in a four-letter code.",
      "source": "Human Genome Project announcement, 2003",
      "url": "/media/quotes/technologyType/genetics.mp3"
    },
    "requires": ["technologyType:internet"],
    "x": 2,
    "y": 114,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 756
      }
    ]
  },
  {
    "category": "eraType:information",
    "concept": "conceptType:technology",
    "description": "Fly‑by‑wire is an electronic flight control architecture that replaces mechanical linkages with sensors, computers, and powered actuators. Military jets pioneered digital control laws in the late 20th century, followed by civil adoption on Airbus types. In the 2000s, large implementations entered service on the Airbus A380 and Boeing 787, adding envelope protection, load alleviation, and advanced stability management. Fighters like the F‑35 rely on fly‑by‑wire to control inherently unstable airframes for agility. The approach reduces weight, simplifies maintenance, and integrates tightly with autopilot and flight management systems. Certification practice centers on redundancy, fault tolerance, and software assurance standards such as DO‑178.",
    "image": "/media/images/technologyType/flyByWire.jpg",
    "key": "technologyType:flyByWire",
    "name": "Fly-by-wire",
    "quote": {
      "text": "He turns inside the turn.",
      "source": "Fighter pilot’s remark, 2009",
      "url": "/media/quotes/technologyType/flyByWire.mp3"
    },
    "requires": ["technologyType:globalArmy", "technologyType:rifleScopes"],
    "x": 8,
    "y": 114,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 756
      }
    ]
  },
  {
    "category": "eraType:information",
    "concept": "conceptType:technology",
    "description": "Robotics designs machines that sense, plan, and act to automate physical tasks. The field began with programmable manipulators in 1960s factories and grew with industrial arms for welding, painting, and assembly. Advances in sensors, control theory, and embedded computing broadened applications. In the 2000s, consumer robots entered homes for cleaning, while medical platforms such as the da Vinci system expanded minimally invasive surgery. Mobile robotics progressed with SLAM, computer vision, and lidar, enabling warehouse automation and outdoor inspection. Machine learning improved grasping and navigation. Safety standards evolved for human‑robot collaboration on shared floors. By the 2010s, robotics was central to advanced manufacturing, logistics, and service industries, linking physical operations with digital control and analytics.",
    "image": "/media/images/technologyType/robotics.jpg",
    "key": "technologyType:robotics",
    "name": "Robotics",
    "quote": {
      "text": "I, for one, welcome our new robot overlords.",
      "source": "The Simpsons, 1994",
      "url": "/media/quotes/technologyType/robotics.mp3"
    },
    "requires": ["technologyType:genetics"],
    "x": 0,
    "y": 116,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 792
      }
    ]
  },
  {
    "category": "eraType:information",
    "concept": "conceptType:technology",
    "description": "Renewable energy draws power from replenishable sources such as sunlight, wind, water, and geothermal heat. After early hydroelectric development, growth accelerated in the 2000s with policy incentives, photovoltaic manufacturing scale, and improved turbine design. Utility‑scale solar parks and onshore and offshore wind became major grid additions, with projects like Hornsea One demonstrating multi‑gigawatt offshore deployment. Learning curves drove steep cost declines, while power electronics improved grid compatibility. Grid‑scale batteries began smoothing output and providing ancillary services. Bioenergy and distributed rooftop solar diversified adoption. Integration challenges spurred advances in forecasting, market design, and transmission planning. By the late 2010s, renewables formed a rising share of new generating capacity and anchored decarbonization strategies.",
    "image": "/media/images/technologyType/renewableEnergy.jpg",
    "key": "technologyType:renewableEnergy",
    "name": "Renewable Energy",
    "quote": {
      "text": "Power from the wind, the sun, and the sea.",
      "source": "IRENA promotional material, 2012",
      "url": "/media/quotes/technologyType/renewableEnergy.mp3"
    },
    "requires": ["technologyType:genetics"],
    "x": 4,
    "y": 116,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 792
      }
    ]
  },
  {
    "category": "eraType:information",
    "concept": "conceptType:technology",
    "description": "Homing systems are guidance technologies that allow munitions or vehicles to track and intercept targets autonomously. Development progressed from early acoustic and infrared seekers to radar, imaging sensors, and satellite‑aided navigation. In the 2000s, GPS‑aided kits such as JDAM delivered all‑weather precision in Iraq and Afghanistan. Imaging infrared seekers on missiles like the AIM‑9X enabled high off‑boresight shots and improved countermeasure resistance. Cruise missiles such as the Tomahawk Block IV added in‑flight retargeting and networked updates. Sensor fusion, inertial measurement, and digital signal processing raised accuracy and robustness. These systems reshaped air and naval operations by enabling standoff attack and reducing sorties per target, while driving advances in electronic warfare and decoys.",
    "image": "/media/images/technologyType/homingSystems.jpg",
    "key": "technologyType:homingSystems",
    "name": "Homing Systems",
    "quote": {
      "text": "Fire-and-forget made modern war a long-distance chess game from the sky.",
      "source": "USAF Officer professional journal, 2005",
      "url": "/media/quotes/technologyType/homingSystems.mp3"
    },
    "requires": ["technologyType:flyByWire"],
    "x": 8,
    "y": 116,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 792
      }
    ]
  },
  {
    "category": "eraType:postIndustrial",
    "concept": "conceptType:technology",
    "description": "The online economy conducts commerce through internet platforms, digital payments, and integrated logistics. In the 2000s and 2010s, marketplaces scaled globally as firms such as Amazon and Alibaba combined storefronts, fulfillment, and cloud services. Payment systems including PayPal and Apple Pay reduced friction and expanded cross‑border trade. Search, reviews, and recommendation engines steered demand. The model reshaped retail and advertising, while enabling app‑based services from ride‑hailing to food delivery. Data analytics and personalization became central to customer acquisition and supply planning.",
    "image": "/media/images/technologyType/onlineEconomy.jpg",
    "key": "technologyType:onlineEconomy",
    "name": "Online Economy",
    "quote": {
      "text": "Add to cart.",
      "source": "Amazon checkout button text, 1995",
      "url": "/media/quotes/technologyType/onlineEconomy.mp3"
    },
    "requires": ["technologyType:robotics", "technologyType:renewableEnergy"],
    "x": 2,
    "y": 119,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 800
      }
    ]
  },
  {
    "category": "eraType:postIndustrial",
    "concept": "conceptType:technology",
    "description": "Semiconductors are materials engineered to control electrical conduction, enabling diodes, transistors, and integrated circuits. Postwar silicon technology produced microprocessors and memory that powered computing and telecommunications. Scaling and lithography advances yielded dense system‑on‑chips for smartphones, sensors, and networking gear. By 2018, leading foundries shipped 7 nm‑class processors using advanced patterning and new device architectures. Heterogeneous integration combined CPUs, GPUs, and accelerators for AI workloads. Compound semiconductors expanded power electronics and RF front‑ends, while silicon photovoltaic cells drove growth in solar generation. Global supply chains span design, fabrication, packaging, and metrology. The sector became strategic infrastructure for civilian industry, defense systems, and spaceborne electronics.",
    "image": "/media/images/technologyType/semiconductors.jpg",
    "key": "technologyType:semiconductors",
    "name": "Semiconductors",
    "quote": {
      "text": "The number of transistors doubles about every two years.",
      "source": "Gordon Moore, 1965",
      "url": "/media/quotes/technologyType/semiconductors.mp3"
    },
    "requires": ["technologyType:renewableEnergy", "technologyType:homingSystems"],
    "x": 6,
    "y": 119,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 800
      }
    ]
  },
  {
    "category": "eraType:postIndustrial",
    "concept": "conceptType:technology",
    "description": "Delivery services move goods from depots to consumers through parcel networks, route planning, and last‑mile operations. The sector expanded with e‑commerce, as rapid fulfillment models such as Amazon Prime set time benchmarks. Carriers introduced consumer scheduling tools and real‑time tracking. Urban logistics experimented with micro‑fulfillment, lockers, and electric vans. Platform workforces added flexible capacity via gig‑economy couriers for meals and small parcels. Data analytics optimized load factors and routing, while policy attention grew around labor standards, emissions, and curb access.",
    "image": "/media/images/technologyType/deliveryServices.jpg",
    "key": "technologyType:deliveryServices",
    "name": "Delivery Services",
    "quote": {
      "text": "Neither snow nor rain nor heat nor gloom of night.",
      "source": "Inscription, New York City Post Office, 1914",
      "url": "/media/quotes/technologyType/deliveryServices.mp3"
    },
    "requires": ["technologyType:onlineEconomy"],
    "x": 0,
    "y": 121,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 838
      }
    ]
  },
  {
    "category": "eraType:postIndustrial",
    "concept": "conceptType:technology",
    "description": "Composites are materials formed by combining reinforcing fibers or particles with a matrix to achieve high strength‑to‑weight ratios and tailored properties. Aerospace adoption accelerated with carbon‑fiber reinforced polymers, culminating in primary structures on the Boeing 787, including fuselage barrels and wings. Motorsports advanced crashworthy monocoques in Formula 1. Wind energy relied on composite blades for stiffness and fatigue resistance at large spans. Processes such as prepreg layup, resin infusion, and automated fiber placement matured with nondestructive inspection techniques. Challenges included repair, recycling of thermoset systems, and cost control. Composites broadened design freedom and improved performance in aviation, marine, sporting goods, and pressure vessels.",
    "image": "/media/images/technologyType/composites.jpg",
    "key": "technologyType:composites",
    "name": "Composites",
    "quote": {
      "text": "Stronger than steel, lighter than aluminum.",
      "source": "Boeing 787 Dreamliner press release, 2007",
      "url": "/media/quotes/technologyType/composites.mp3"
    },
    "requires": ["technologyType:onlineEconomy", "technologyType:semiconductors"],
    "x": 4,
    "y": 121,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 838
      }
    ]
  },
  {
    "category": "eraType:postIndustrial",
    "concept": "conceptType:technology",
    "description": "Military drones are uncrewed aircraft used for surveillance, targeting, and strike. Early reconnaissance types matured in the 1990s; armed operations expanded after 2001. The MQ‑1 Predator provided persistent ISR and, when armed, remote strike capability over Afghanistan and other theaters. The MQ‑9 Reaper increased payload, endurance, and sensor resolution. Satellite links and networked control enabled long‑range missions from distant bases. Affordable systems such as the Bayraktar TB2 proved effective in Syria, Libya, and Ukraine. Integration with precision munitions, synthetic‑aperture radar, and electronic intelligence reshaped targeting cycles, while air defense and counter‑UAS measures evolved in response.",
    "image": "/media/images/technologyType/militaryDrones.jpg",
    "key": "technologyType:militaryDrones",
    "name": "Military Drones",
    "quote": {
      "text": "The operator remains thousands of miles away.",
      "source": "USAF fact sheet on MQ-1 Predator, 2005",
      "url": "/media/quotes/technologyType/militaryDrones.mp3"
    },
    "requires": ["technologyType:semiconductors"],
    "x": 8,
    "y": 121,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 838
      }
    ]
  },
  {
    "category": "eraType:postIndustrial",
    "concept": "conceptType:technology",
    "description": "Virtual Reality is the creation of immersive, computer-generated environments viewed through head‑mounted displays with motion tracking. Early systems in the 1960s and 1990s proved the concept but were limited by sensors and graphics. The 2010s brought low‑latency displays, precise six‑degree‑of‑freedom tracking, and consumer cost points. Oculus Rift launched to consumers in 2016, followed by PlayStation VR in the same year. Room‑scale operation, inside‑out tracking, and haptic controllers improved presence. Enterprise adoption grew in aviation, medicine, defense, and industrial training, where risk and cost are high. Content ecosystems expanded with game engines and dedicated app stores. VR also supports design review, data visualization, and telepresence. Ongoing work targets lighter headsets, wider fields of view, varifocal optics, and improved passthrough for mixed reality. The field continues to converge with graphics hardware and spatial computing platforms.",
    "image": "/media/images/technologyType/virtualReality.jpg",
    "key": "technologyType:virtualReality",
    "name": "Virtual Reality",
    "quote": {
      "text": "There is no spoon.",
      "source": "The Matrix, 1999",
      "url": "/media/quotes/technologyType/virtualReality.mp3"
    },
    "requires": ["technologyType:deliveryServices"],
    "x": 0,
    "y": 123,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 876
      }
    ]
  },
  {
    "category": "eraType:postIndustrial",
    "concept": "conceptType:technology",
    "description": "Hypersonic flight occurs at speeds above Mach 5, where aerodynamic heating and compression dominate vehicle behavior. Two main approaches matured in the 2000s and 2010s. Airbreathing systems use supersonic combustion ramjets, demonstrated by the X‑51A Waverider tests from 2010 to 2013. Boost‑glide systems are lofted by rockets and then glide at hypersonic speed within the atmosphere; China’s DF‑17 and Russia’s Avangard entered service around 2019. Key challenges include thermal protection, high‑temperature materials, guidance in plasma‑affected regimes, and precision over long ranges. Ground facilities, high‑enthalpy wind tunnels, and advanced CFD supported design. Military interest centers on prompt strike and missile defense penetration. Civil applications remain exploratory due to thermal loads, emissions, and cost. International testing and deployment accelerated a new strategic competition in flight regimes once limited to research programs.",
    "image": "/media/images/technologyType/hypersonicFlight.jpg",
    "key": "technologyType:hypersonicFlight",
    "name": "Hypersonic Flight",
    "quote": {
      "text": "Blink and you’ll miss it.",
      "source": "Media coverage of X-51A flight test, 2010",
      "url": "/media/quotes/technologyType/hypersonicFlight.mp3"
    },
    "requires": ["technologyType:composites"],
    "x": 4,
    "y": 123,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 876
      }
    ]
  },
  {
    "category": "eraType:postIndustrial",
    "concept": "conceptType:technology",
    "description": "Stealth is a set of techniques that reduce detectability across radar, infrared, and acoustic sensors. Foundational methods include shaping to control radar reflections, radar‑absorbent materials, edge alignment, and careful treatment of inlets and exhaust. After pioneering aircraft in the late Cold War, low‑observability matured operationally in the 2000s. The F‑22 achieved initial operating capability in 2005, and the F‑35 introduced multirole low‑observable operations afterward. Thermal management, plume cooling, and coatings reduced infrared signatures. Stealth requires rigorous manufacturing tolerances and maintenance to preserve surface quality. Adversaries pursued counter‑stealth measures such as low‑frequency radars, multistatic networks, and infrared search and track. Modern doctrine blends stealth with electronic warfare, sensor fusion, and stand‑off weapons. The approach remains central to survivability against integrated air defenses, despite cost and sustainment demands.",
    "image": "/media/images/technologyType/stealth.jpg",
    "key": "technologyType:stealth",
    "name": "Stealth",
    "quote": {
      "text": "First look, first shot, first kill.",
      "source": "USAF F-22 promotional material, 2017",
      "url": "/media/quotes/technologyType/stealth.mp3"
    },
    "requires": ["technologyType:militaryDrones"],
    "x": 8,
    "y": 123,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 876
      }
    ]
  },
  {
    "category": "eraType:nano",
    "concept": "conceptType:technology",
    "description": "Artificial Intelligence enables machines to perceive, learn, and act. Early symbolic systems and neural networks cycled through optimism and setbacks. The field advanced rapidly after 2010 as large datasets and GPUs unlocked deep learning. ImageNet breakthroughs in 2012 established convolutional networks for vision. AlphaGo’s 2016 victory demonstrated reinforcement learning at scale. Transformer architectures, introduced in 2017, drove major progress in language modeling and multimodal systems. AI now supports translation, recommendation, speech recognition, medical imaging, logistics, and elements of autonomy. Toolchains integrate optimized hardware, distributed training, and MLOps. Research addresses robustness, interpretability, and alignment with human goals. Policy frameworks evolved to manage data governance and safety. The discipline remains a fast‑moving synthesis of algorithms, compute, and real‑world deployment.",
    "image": "/media/images/technologyType/artificialIntelligence.jpg",
    "key": "technologyType:artificialIntelligence",
    "name": "Artificial Intelligence",
    "quote": {
      "text": "Success in creating AI would be the biggest event in human history.",
      "source": "Stephen Hawking, 2014",
      "url": "/media/quotes/technologyType/artificialIntelligence.mp3"
    },
    "requires": ["technologyType:virtualReality", "technologyType:hypersonicFlight"],
    "x": 2,
    "y": 126,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 880
      }
    ]
  },
  {
    "category": "eraType:nano",
    "concept": "conceptType:technology",
    "description": "Private space flight denotes commercial development and operation of launch vehicles and spacecraft. Following government dominance during the Cold War, the 2000s opened access to new firms. SpaceX, founded in 2002, achieved orbital launch with Falcon 1 in 2008 and pioneered booster reusability with Falcon 9 landings from 2015 onward. Crew Dragon began crewed missions in 2020. Blue Origin’s New Shepard enabled suborbital tourism and technology maturation. Rocket Lab’s Electron expanded dedicated smallsat launches. Falling launch costs and rideshare services accelerated satellite constellations for communications and Earth observation. The sector professionalized payload integration, insurance, and licensing under regulators such as the FAA. Reusability, mass production, and in‑house avionics reshaped the economics of access to orbit and suborbital research.",
    "image": "/media/images/technologyType/privateSpaceFlight.jpg",
    "key": "technologyType:privateSpaceFlight",
    "name": "Private Space Flight",
    "quote": {
      "text": "Let’s make life multiplanetary",
      "source": "Elon Musk, 2017",
      "url": "/media/quotes/technologyType/privateSpaceFlight.mp3"
    },
    "requires": ["technologyType:hypersonicFlight", "technologyType:stealth"],
    "x": 6,
    "y": 126,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 880
      }
    ]
  },
  {
    "category": "eraType:nano",
    "concept": "conceptType:technology",
    "description": "Weaponized lasers are directed‑energy systems that deliver concentrated light to damage sensors, drones, small boats, or incoming munitions. Power‑scaling of solid‑state and fiber lasers in the 2000s and 2010s enabled field trials. The US Navy demonstrated LaWS in 2014 and tested HELIOS for ship defense. Israel’s Iron Beam advanced ground‑based interception trials. Advantages include speed‑of‑light engagement, deep magazines, and low cost per shot. Challenges involve atmospheric attenuation, beam control, power supply, and thermal management. Operational concepts pair lasers with conventional defenses and networked sensors for layered protection.",
    "image": "/media/images/technologyType/weaponizedLasers.jpg",
    "key": "technologyType:weaponizedLasers",
    "name": "Weaponized Lasers",
    "quote": {
      "text": "Sharks with frickin' laser beams on their heads!",
      "source": "Dr. Evil, Austin Powers, 1997",
      "url": "/media/quotes/technologyType/weaponizedLasers.mp3"
    },
    "requires": ["technologyType:stealth"],
    "x": 10,
    "y": 126,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 880
      }
    ]
  },
  {
    "category": "eraType:nano",
    "concept": "conceptType:technology",
    "description": "Nuclear fusion joins light nuclei to release energy, most commonly using deuterium–tritium fuel. Research began in the mid-twentieth century and advanced through magnetic confinement machines such as tokamaks and stellarators, and inertial confinement driven by high-power lasers. Superconducting magnets, advanced plasma control, and materials for extreme neutron and heat loads marked key progress. Future deployments include grid-connected plants that deliver firm baseload electricity and high-temperature process heat. Fusion drives enable rapid interplanetary propulsion by sustaining high specific power without oxidizer. Industrial applications include ammonia synthesis and green hydrogen production, using efficient steam and electricity from the reactor complex. Fusion-powered desalination facilities provide large-scale potable water for megacities. Fuel cycles, tritium breeding blankets, and remote handling define plant architecture, while regulatory frameworks adapt from fission experience. The field links plasma physics, materials science, cryogenics, and power engineering into integrated energy systems.",
    "image": "/media/images/technologyType/nuclearFusion.jpg",
    "key": "technologyType:nuclearFusion",
    "name": "Nuclear Fusion",
    "quote": {
      "text": "Fusion is always thirty years away — until it's not.",
      "source": "Physics community proverb",
      "url": "/media/quotes/technologyType/nuclearFusion.mp3"
    },
    "requires": [
      "technologyType:artificialIntelligence",
      "technologyType:privateSpaceFlight",
      "technologyType:weaponizedLasers"
    ],
    "x": 6,
    "y": 128,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 920
      }
    ]
  },
  {
    "category": "eraType:nano",
    "concept": "conceptType:technology",
    "description": "Future tech is a catch-all term for breakthroughs that exceed contemporary capabilities and reshape systems at scale. It spans artificial general intelligence that stewards complex infrastructure, room-temperature superconductors that transform power and transport, molecular nanofabrication for atomically precise manufacturing, and self-replicating space probes for rapid interstellar surveys. Such advances demand new architectures, verification methods, and governance. Roadmaps use scenario analysis and technology readiness metrics to manage uncertainty. Investment often pairs long-horizon public research with private prototypes and field trials. The category frames horizon scanning in defense, energy, and space policy.",
    "image": "/media/images/technologyType/futureTech.jpg",
    "key": "technologyType:futureTech",
    "name": "Future Tech",
    "quote": {
      "text": "Prediction is very difficult, especially about the future.",
      "source": "Niels Bohr, ca. 1940",
      "url": "/media/quotes/technologyType/futureTech.mp3"
    },
    "requires": ["technologyType:nuclearFusion"],
    "x": 6,
    "y": 130,
    "yields": [
      {
        "type": "yieldType:scienceCost",
        "amount": 1000
      }
    ]
  }
]
